package com.mycompany.myapp;
import android.app.*;
import android.os.*;
//
//import android.speech.tts.*;
import android.util.*;
import android.view.View;
import android.view.View.OnClickListener;
import android.widget.*;
import java.util.*;
import android.content.*;
import android.speech.tts.*;
import android.content.*;


public class coachUtility 
{
	protected SharedPreferences mSettings;
	protected SharedPreferences mSettingsData;
	final String sDel1 ="》,"; 
	final String sDel2 ="}•,";
	final String sDel3 ="}°,";
	final String sDel4 ="}°°,";
	final String sDel5 ="}°°°,";
	final String sDel6 ="}°°°°,";

	final String sBegDel1 ="《";  
	final String sBegDel2 ="{•,";
	final String sBegDel3 ="{°,";
	final String sBegDel4 ="{°°,";
	final String sBegDel5 ="{°°°,";
	final String sBegDel6 ="{°°°°,";

	final String SET_FILE_NAME = "coachsettings_test2";
	final String SET_TRAIN_INDEX = "trainindex";
	final String SET_TRAIN_ID = "trainid";

	//<<для сброса настроек, чтобы вернуться к чтению данных из массивов в этом классе, изменить имена ниже
	final String SET_AMETARITHM_FILE_NAME = "ametarithmanddeals_tmp36";
	final String SET_AMETARITHM_BCK1_FILE_NAME = "bck1_ametarithmanddeals_tmp36";
	//>>

	final String SET_AMETARITHM = "ametarithm";
	final String SET_ARITHM = "arithm";
    final String SET_ADEALS100 = "adeals100";
	final String DELIMITER = "\n\n<THIS IS DELIMITER>\n\n";

	protected String sAMetaRithm="";
	protected String sARithm="";
	protected String sADeals100="";
	protected int Gl_SelectedIndexInit = 0;


	protected String[][][][][] aMetaRithm;
	protected String[][][][] aRithm;
	protected String[][][][] aDeals100;

	protected void onCreate(Bundle savedInstanceState)
	{

	}

	
	public String aMetaRithmB2TechString(String[][][][][][] aSource)
	{
		String sRet = "";
		for (String[][][][][] a5d: aSource)
		{
			sRet += sBegDel6;
		for (String[][][][] a4d: a5d)
		{
			sRet += sBegDel5;
			for (String[][][] a3d: a4d)
			{
				sRet += sBegDel4;
				for (String[][] a2d: a3d)
				{
					sRet += sBegDel3;
					for (String[] a1d: a2d)
					{
						sRet += sBegDel2;
						for (String item : a1d)
						{
							sRet += ""  + sBegDel1 + item.trim() + "" + sDel1 + ""; 
						}
						sRet += sDel2 /*+" \n"*/; 
					}
					sRet += sDel3/* +" \n"*/; 
				}
				sRet += sDel4 + "\n"; 
			}
			sRet += sDel5  + "\n\n\n\n";//\n\n==============================="+"\n"; 
		}   
		sRet += sDel6  + "\n\n\n\n\n";//\n\n==============================="+"\n"; 
			
		}
		return sRet;
	}
	

	public String aMetaRithm2TechString(String[][][][][] aSource)
	{
		String sRet = "";
		for (String[][][][] a4d: aSource)
		{
			sRet += sBegDel5;
			for (String[][][] a3d: a4d)
			{
				sRet += sBegDel4;
				for (String[][] a2d: a3d)
				{
					sRet += sBegDel3;
					for (String[] a1d: a2d)
					{
						sRet += sBegDel2;
						for (String item : a1d)
						{
							sRet += ""  + sBegDel1 + item.trim() + "" + sDel1 + ""; 
						}
						sRet += sDel2 /*+" \n"*/; 
					}
					sRet += sDel3/* +" \n"*/; 
				}
				sRet += sDel4 + "\n"; 
			}
			sRet += sDel5  + "\n\n\n\n";//\n\n==============================="+"\n"; 
		}   
		return sRet;
	}

	public String TechString2aMetaRithm(String _str)
	{
		String str = //new String(
			_str.replace(sBegDel1, "").replace(sBegDel2, "").replace(sBegDel3, "").replace(sBegDel4, "").replace(sBegDel5, "")
			;//);
		int i1 = 0;
		int i2 = 0;
		int i3 = 0;
		int i4 = 0;
		ArrayList<ArrayList<ArrayList<ArrayList<ArrayList<String>>>>>   
			al5d = new  ArrayList<ArrayList<ArrayList<ArrayList<ArrayList<String>>>>>();
		for (String item1: str.split(sDel5))
		{
			al5d.add(null);
			for (String item2: item1.split(sDel4))
			{
				al5d.get(i4).add(null);
				for (String item3: item2.split(sDel3))
				{
					al5d.get(i4).get(i3).add(null);
					for (String item4: item3.split(sDel2))
					{
						al5d.get(i4).get(i3).get(i2).add(null);
						for (String item5: item4.split(sDel1))
						{
							al5d.get(i4).get(i3).get(i2).get(i1).add(item5.trim());
							i1++;
						}
						i2++;
					}
					i3++; 
				}
				i4++;
			}  
		}	
		return al5d.toString();
	}

	public String a12string(String[] as1)
	{
		String sret="";
		for (String s: as1) sret += s + sDel5;
		return sret;
	}
	public String al12string(ArrayList<String>  as1)
	{
		String sret="";
		for (String s: as1) sret += s + sDel5;
		return sret;
	}

	public ArrayList<String> mSplit1d(String str, String sdel)
	{
		ArrayList<String> slret = new ArrayList<String>()  ;
		String s=//new String(
			str;//);
		while (s.indexOf(sdel) >= 0)
		{
			slret.add(s.substring(0, s.indexOf(sdel)).trim());
			s = s.substring(s.indexOf(sdel) + sdel.length(), s.length());
		}
		return slret;	 
	}


	public void  mSplit5d(String _str)
	{
        String str =//new String( 
			_str.replace(sBegDel1, "").replace(sBegDel2, "").replace(sBegDel3, "").replace(sBegDel4, "").replace(sBegDel5, "")
			;//);
		ArrayList<String> al1 = new ArrayList<String>() ;
		al1 = mSplit1d(str, sDel5);

		ArrayList<ArrayList<String>> al2 = new ArrayList<ArrayList<String>>() ;
		for (String s: al1) al2.add(mSplit1d(s, sDel4)); 

		ArrayList<ArrayList<ArrayList<String>>> al3 = new ArrayList<ArrayList<ArrayList<String>>>() ;
		for (ArrayList<String> ial1: al2)
		{
			al3.add(new ArrayList<ArrayList<String>>());
			for (String s: ial1) al3.get(al3.size() - 1).add(mSplit1d(s, sDel3)); /// al3.add!!
		}

		ArrayList<ArrayList<ArrayList<ArrayList<String>>>> al4 = new ArrayList<ArrayList<ArrayList<ArrayList<String>>>>() ;
		for (ArrayList<ArrayList<String>> ial2: al3)
		{
			al4.add(new ArrayList<ArrayList<ArrayList<String>>>());
			for (ArrayList<String> ial1: ial2)
			{ 
				al4.get(al4.size() - 1).add(new ArrayList<ArrayList<String>>());
				for (String s: ial1)  al4.get(al4.size() - 1).get(al4.get(al4.size() - 1).size() - 1).add(mSplit1d(s, sDel2)); 
			}  
		} 	 
		ArrayList<ArrayList<ArrayList<ArrayList<ArrayList<String>>>>> al5 = new ArrayList<ArrayList<ArrayList<ArrayList<ArrayList<String>>>>>() ;
		for (ArrayList<ArrayList<ArrayList<String>>> ial3: al4)
		{
			al5.add(new ArrayList<ArrayList<ArrayList<ArrayList<String>>>>());
			for (ArrayList<ArrayList<String>> ial2: ial3)
			{
				al5.get(al5.size() - 1).add(new ArrayList<ArrayList<ArrayList<String>>>());
				for (ArrayList<String> ial1: ial2)
				{ 
					al5.get(al5.size() - 1).get(al5.get(al5.size() - 1).size() - 1)  .add(new ArrayList<ArrayList<String>>());
					for (String s: ial1)
					{  
						al5.get(al5.size() - 1).get(al5.get(al5.size() - 1).size() - 1). get(al5.get(al5.size() - 1).get(al5.get(al5.size() - 1).size() - 1).size() - 1)   .add(mSplit1d(s, sDel1)); 
					}
				}  
			} 	  
		}

		aMetaRithm = new String[al5.size()][][][][];
		int i0 = 0;
		for (ArrayList<ArrayList<ArrayList<ArrayList<String>>>> ial5: al5)
		{
			aMetaRithm[i0]  = new String [ ial5.size() ][][][];
			int i1 = 0;
			for (ArrayList<ArrayList<ArrayList<String>>> ial4: ial5)
			{
				aMetaRithm[i0][i1] = new String [ ial4.size() ][][];
				int i2 = 0;
				for (ArrayList<ArrayList<String>> ial3: ial4)
				{
					aMetaRithm[i0][i1][i2] = new String [  ial3.size()][];
					int i3 = 0;
					for (ArrayList<String> ial2: ial3)
					{ 
						aMetaRithm[i0][i1][i2][i3] = new String [ ial2.size() ];
						int i4 = 0;
						for (String s: ial2)
						{  
							aMetaRithm[i0][i1][i2][i3][i4] = s.trim(); 
							i4++;
						}
						i3++;
					}  
					i2++;
				} 	  
				i1++;
			}
			i0++;
		}

	}
	//
	public String aDeals2TechString(String[][][] aSource)
	{
		String sRet = "";

		for (String[][] a2d: aSource)
		{
			sRet += sBegDel3;
			for (String[] a1d: a2d)
			{
				sRet += sBegDel2;
				for (String item : a1d)
				{
					sRet += "" + sBegDel1  + item.trim() + "" + sDel1 + ""; 
				}
				sRet += sDel2 /*+" \n"*/; 
			}
			sRet += sDel3 + " \n\n\n";
		}

		return sRet;
	}

	public String aRithm2TechString(String[][][][] aSource)
	{
		String sRet = //new String(
			sBegDel5
			;//);
		for (String[][][] a3d: aSource)
		{
			sRet += sBegDel4;
			for (String[][] a2d: a3d)
			{
				sRet += sBegDel3;
				for (String[] a1d: a2d)
				{
					sRet += sBegDel2;
					for (String item : a1d)
					{
						sRet += "" + sBegDel1  + item.trim() + "" + sDel1 + ""; 
					}
					sRet += sDel2 /*+" \n"*/; 
				}
				sRet += sDel3/* +" \n"*/; 
			}
			sRet += sDel4; 
		}
		sRet += sDel5  + "\n"; 
		//}   
		return sRet;
	}

	public void mSplit4d(String _str)
	{
        String str = //new String( 
			_str.replace(sBegDel1, "").replace(sBegDel2, "").replace(sBegDel3, "").replace(sBegDel4, "").replace(sBegDel5, "")
			;//);
		ArrayList<String> al1 = new ArrayList<String>() ;
		al1 = mSplit1d(str, sDel4);

		ArrayList<ArrayList<String>> al2 = new ArrayList<ArrayList<String>>() ;
		for (String s: al1) al2.add(mSplit1d(s, sDel3)); 

		ArrayList<ArrayList<ArrayList<String>>> al3 = new ArrayList<ArrayList<ArrayList<String>>>() ;
		for (ArrayList<String> ial1: al2)
		{
			al3.add(new ArrayList<ArrayList<String>>());
			for (String s: ial1) al3.get(al3.size() - 1).add(mSplit1d(s, sDel2)); 
		}

		ArrayList<ArrayList<ArrayList<ArrayList<String>>>> al4 = new ArrayList<ArrayList<ArrayList<ArrayList<String>>>>() ;
		for (ArrayList<ArrayList<String>> ial2: al3)
		{
			al4.add(new ArrayList<ArrayList<ArrayList<String>>>());
			for (ArrayList<String> ial1: ial2)
			{ 
				al4.get(al4.size() - 1).add(new ArrayList<ArrayList<String>>());
				for (String s: ial1)  al4.get(al4.size() - 1).get(al4.get(al4.size() - 1).size() - 1).add(mSplit1d(s, sDel1)); 
			}  
		} 	 

		aRithm  = new String [ al4.size() ][][][];
		int i1 = 0;
		for (ArrayList<ArrayList<ArrayList<String>>> ial4: al4)
		{
			aRithm[i1] = new String [ ial4.size() ][][];
			int i2 = 0;
			for (ArrayList<ArrayList<String>> ial3: ial4)
			{
				aRithm[i1][i2] = new String [  ial3.size()][];
				int i3 = 0;
				for (ArrayList<String> ial2: ial3)
				{ 
					aRithm[i1][i2][i3] = new String [ ial2.size() ];
					int i4 = 0;
					for (String s: ial2)
					{  
						aRithm[i1][i2][i3][i4] = s.trim(); 
						i4++;
					}
					i3++;
				}  
				i2++;
			} 	  
			i1++;
		}

	}

//переход на новый формат дел для замены mSplit4d
	public String[][][][] mSplit4d100(String _str)
	{
        String str = //new String( 
			_str.replace(sBegDel1, "").replace(sBegDel2, "").replace(sBegDel3, "").replace(sBegDel4, "").replace(sBegDel5, "")
			;//);
		ArrayList<String> al1 = new ArrayList<String>() ;
		al1 = mSplit1d(str, sDel4);

		ArrayList<ArrayList<String>> al2 = new ArrayList<ArrayList<String>>() ;
		for (String s: al1) al2.add(mSplit1d(s, sDel3)); 

		ArrayList<ArrayList<ArrayList<String>>> al3 = new ArrayList<ArrayList<ArrayList<String>>>() ;
		for (ArrayList<String> ial1: al2)
		{
			al3.add(new ArrayList<ArrayList<String>>());
			for (String s: ial1) al3.get(al3.size() - 1).add(mSplit1d(s, sDel2)); /// al3.add!!
		}

		ArrayList<ArrayList<ArrayList<ArrayList<String>>>> al4 = new ArrayList<ArrayList<ArrayList<ArrayList<String>>>>() ;
		for (ArrayList<ArrayList<String>> ial2: al3)
		{
			al4.add(new ArrayList<ArrayList<ArrayList<String>>>());
			for (ArrayList<String> ial1: ial2)
			{ 
				al4.get(al4.size() - 1).add(new ArrayList<ArrayList<String>>());
				for (String s: ial1)  al4.get(al4.size() - 1).get(al4.get(al4.size() - 1).size() - 1).add(mSplit1d(s, sDel1)); 
			}  
		} 	 

		String [][][][] aRet  = new String [ al4.size() ][][][];
		int i1 = 0;
		for (ArrayList<ArrayList<ArrayList<String>>> ial4: al4)
		{
			aRet[i1] = new String [ ial4.size() ][][];
			int i2 = 0;
			for (ArrayList<ArrayList<String>> ial3: ial4)
			{
				aRet[i1][i2] = new String [  ial3.size()][];
				int i3 = 0;
				for (ArrayList<String> ial2: ial3)
				{ 
					aRet[i1][i2][i3] = new String [ ial2.size() ];
					int i4 = 0;
					for (String s: ial2)
					{  
						aRet[i1][i2][i3][i4] = s.trim(); 
						i4++;
					}
					i3++;
				}  
				i2++;
			} 	  
			i1++;
		}
		return aRet;

	}
	
	public String prefs2string( SharedPreferences prefs){
	 //SharedPreferences prefs = getSharedPreferences(SET_AMETARITHM_FILE_NAME, Context.MODE_PRIVATE);
	 String spref ="";
	 try
	 {  
	 Map<String,?> prefsMap = prefs.getAll();

	 for (Map.Entry<String,?> entry : prefsMap.entrySet())
	 spref += entry.getKey() + DELIMITER  + entry.getValue().toString() + DELIMITER;            

	 }
	 catch (Exception e)
	 {
	 Toast.makeText(null,//getApplicationContext(),
	 "prefs2string() Exception: " + e.toString(), Toast.LENGTH_LONG).show();
	 }
	 return spref;
	 }
	
	public void string2prefs(String sprefs)
	{
		SharedPreferences.Editor editor = mSettingsData.edit();
		String[] aprefs = sprefs.split(DELIMITER);
		for (int i=0;i < aprefs.length;i++)
		{
			if ((aprefs[i].toUpperCase().equals(SET_AMETARITHM.toUpperCase())) ||
				(aprefs[i].toUpperCase().equals(SET_ADEALS100.toUpperCase())) ||
				(aprefs[i].toUpperCase().equals(SET_ARITHM.toUpperCase())) 
				)
				editor.putString(aprefs[i], aprefs[i + 1]);
		}
        editor.apply();

	}

//#####################################################
//####    БАЗА ДАННЫХ ПО УМОЛЧАНИЮ    #########	
//#####################################################	
	public String[][][][][]  aMetaRithmInit = 
	{  

		//=====================
		//================Шаблоны для копирования  ( верхний уровень)
	    {
			{{{"name","Шаблоны тренировок"} ,{"id","шаблоны"}  ,{"parentid",""}}
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{  "showInSpinner","0" } ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""}}},
			{{{"tags",""}}},
			{{{"parameters"}
				}       },

			{},{},{},{},{},{}, //резерв
			{   
				//{{"5500"},{" (180+"},{"0"},{"1"}},
				//{{"3"},{"2"},{"0"},{"сказать","уборка дома"}},
			}
		},
		//=====================
		/*
		//================Утренняя тренировка  ( верхний уровень)
	    {
			{{{"name","Утренняя тренировка"} ,{"id","утреннняя_тренировка"}  ,{"parentid",""}}
		      ,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{  "showInSpinner","0"  } ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""}}},
			{{{"tags",""}}},
			{{{"parameters"}
				}       },

			{},{},{},{},{},{}, //резерв
			{   
				//{{"5500"},{" (180+"},{"0"},{"1"}},
				//{{"3"},{"2"},{"0"},{"сказать","уборка дома"}},
			}
		},
		//=====================
		//================Вечерняя тренировка  ( верхний уровень)
	    {
			{{{"name","Вечерняя тренировка"} ,{"id","вечерняя_тренировка"}  ,{"parentid",""}}
		      ,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{ "showInSpinner","0"  } ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""}}},
			{{{"tags",""}}},
			{{{"parameters"}
				}       },

			{},{},{},{},{},{}, //резерв
			{   
				//{{"5500"},{" (180+"},{"0"},{"1"}},
				//{{"3"},{"2"},{"0"},{"сказать","уборка дома"}},
			}
		},
		//=====================
	
		*/
		//=========== тест =====
	    {
			{{{"name","тест ссылок на ритмы"} ,{"id","тест"}  ,{"parentid",""}}
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"},{"дата последнего выполнения",""} }},
			{{{"tags",""}}},
			{{{"parameters"}
					,{"par000","float","скорость (%)","100","значение рассчитать по формуле",""}
			

			 }       
			},

			{},{},{},{},{}, //резерв
			{//ритмы только для использования в ссылках
	            {{"2","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","ура"},{"id","ура"},{"ритмы",""},{"ритм только для использования в ссылках","1"}}, 
				{{"3","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","не ура"},{"id","неура"}, {"ритмы",""},{"ритм только для использования в ссылках","1"}},
				
			},
			{   
				{{"2","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","ура"},{"id","треня"},{"ритмы","ура,ура,неура"}},
						
			}
		},
		//=====================
		//=========== общие упражнения для позвоночника =====
	    {
			{{{"name","позвоночник общий без шеи"} ,{"id","позвоночник_общий"}  ,{"parentid",""}}
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"},{"дата последнего выполнения",""} }},
			{{{"tags","спина#"}}},
			{{{"parameters"}
					,{"par000","float","скорость (%)","100","значение рассчитать по формуле",""}
				
				}       },

			{},{},{},{},{},{}, //резерв
			{   
			//время берет из прошлого упра !
			     {{"1","раз по"},{"11","сек с дисперсией"},{"0"},{"сказать","Упражнения для позвоночника на растягивание. Каждое упражнение делать после вдоха, на выдохе. После выдоха держать-растягиваь мышцы на задержке дыхания."}},
				//{{"1","раз по"},{"20","сек с дисперсией"},{"0"},{"сказать",""}},
				//с
				{{"1","раз по"},{"7","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение один. Лежа на спине, на выдохе согните ноги. колени обхватите руками и притяните к груди."}},
				{{"1","раз по"},{"8","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				//2
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Упражнение два. Лежа на спине, на выдохе согните одну ногу, другую - вытяните. Обхватите колено согнутой ноги и притяните его к груди. То же самое проделайте с другой ногой"}},
				//{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение три, повороты шеи"}},
				//{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Медленно поворачивайте шею чтобы увидеть левое плечо, Затем также направо, Держите три секунды и вернитесь в исходное положение"}},
				{{"1","раз по"},{"13","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				//3
				//{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение два, разгибание шеи"}},
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Упражнение три. Встаньте на четвереньки, выгните спину, втяните живот, голову наклоните к груди, зафиксируйти позу. Плавно опустите спину, поднимите голову. Не прогибайтесь в пояснице"}},
				{{"1","раз по"},{"13","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох выгнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох выгнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох выгнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох выгнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох выгнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох выгнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох выгнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох выгнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох выгнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох выгнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				
				//4
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение четыре. Лежа на спине с вытянутыми вдоль туловища руками и слегка согнутыми ногами. На выдохе положите ноги на пол в правую сторону, при этом верхнюю часть туловища и голову поверните влево."}},
				{{"1","раз по"},{"15","сек с дисперсией"},{"0"},{"сказать","Позвоночник должен достаточно сильно изогнуться на участке поясничного отдела. Оставайтесь в таком положении не более пяти секунд. На вдохе вернитесь в исходное положение. Повторите в другую сторону. "}},
				{{"1","раз по"},{"14","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				//5
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Упражнение семь. Лежа на спине, под головой подушечка высотой пять семь сантиметров и валик под коленями. Поочередно выпрямляйте ноги, тяните носок."}},
			    {{"1","раз по"},{"13","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}}, 
				{{"1","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}}, 
				//
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнени для укрепления мышц живота и спины"}},
				//6 (1)
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Упражнение один. Лежа на спине, поочередно прижимайте к полу лопатки, таз, пятки прямых ног. Каждый раз фиксируйте позу на пять-семь секунд."}},
			    {{"1","раз по"},{"12","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох лопатки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох таз"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох пятки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох лопатки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох таз"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох пятки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох лопатки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох таз"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох пятки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох лопатки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох таз"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох пятки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох лопатки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох таз"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох пятки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох лопатки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох таз"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох пятки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох лопатки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох таз"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох пятки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох лопатки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох таз"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох пятки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох лопатки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох таз"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох пятки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох лопатки"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох таз"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох пятки"}}, 
				
				//7 (2)
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Упражнение два. Лежа на спине согните ноги, кисти рук можно сцепить за затылком. Приподнимите плечи и голову. Прижмите поясницу к полу. Зафиксируйте позу на пять секунд и вернитесь в исходное положение."}},
				//{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Отклоните голову назад сохраняя уровень нижней челюсти. Держите три секунды и вернитесь в исходное положение"}},
				{{"1","раз по"},{"12","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				
				//8 (3)
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Упражнение три. Лежа на спине согните ноги. Приподнимите таз и напрягите ягодицы не прогибаясь в пояснице. Зафиксируйте позу на пять секунд и вернитесь в исходное положение."}},
				//{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Отклоните голову назад сохраняя уровень нижней челюсти. Держите три секунды и вернитесь в исходное положение"}},
				{{"1","раз по"},{"15","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				//9 (4)
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Упражнение четыре. Лежа животом на валике и раскинув руки в стороны, приподнимайте верхнюю часть туловища на несколько сантиметров и задерживайтесь в таком положении на пять секунд."}},
				//{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Отклоните голову назад сохраняя уровень нижней челюсти. Держите три секунды и вернитесь в исходное положение"}},
				{{"1","раз по"},{"13","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох поднять"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				
				//10(5)
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение пять, лежа на животе, прямые руки немного раздвинуты. Поднимите одну ногу как можно выше. Держите ее в таком положении пять секунд и затем отпустите. Сделайте то же самое с другой ногой"}},
				//{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Осторожно сгибайте и разгибайте шею, производя кивательные движения. Старайтесь растянуть шею. Держите три секунды."}},
				{{"1","раз по"},{"14","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
			    //
				//(6)
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение шесть. Лежа на боку, рука на полу вытянута вверх(вперед). Согните находящуюся на полу ногу, другую ногу вытяните. Поднимайте и опускайте вытянутую ногу несколько раз. Затем повторите упражнение на другом боку."}},
				//{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Осторожно сгибайте и разгибайте шею, производя кивательные движения. Старайтесь растянуть шею. Держите три секунды."}},
				{{"1","раз по"},{"17","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},		
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Перевернуться на другой бок"}},
	            {{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},		
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох вниз"}},
				
				//(7)
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение семь, лежа на животе, вытяните руки вверх (точнее вперед), лоб прижмите к полу. Одновременно поднимите левую руку и правую ногу.  Зафиксируйте позу на пять секунд и затем вернитесь в исходную позицию. Сделайте то же самое с другой ногой и рукой."}},
				//{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Осторожно сгибайте и разгибайте шею, производя кивательные движения. Старайтесь растянуть шею. Держите три секунды."}},
				{{"1","раз по"},{"19","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				//
				//(8)
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение восемь. Встаньте на четвереньки, напрягите мышцы живота, вытяните одну ногу назад параллельно полу. Зафиксируйте позу на пять секунд и затем вернитесь в исходную позицию. Сделайте то же самое с другой ногой."}},
				//{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Осторожно сгибайте и разгибайте шею, производя кивательные движения. Старайтесь растянуть шею. Держите три секунды."}},
				{{"1","раз по"},{"16","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"2","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"5","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","держим"}}, 
				//
				//(9)
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение девять. Встаньте на четвереньки, напрягите мышцы живота, вытяните правую руку вверх параллельно полу а левую ногу назад параллельно полу. Плавно верните руку и ногу в исходное положение. Сделайте то же самое с другой ногой и рукой."}},
				//{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Осторожно сгибайте и разгибайте шею, производя кивательные движения. Старайтесь растянуть шею. Держите три секунды."}},
				{{"1","раз по"},{"17","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох левая"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох правая"}},
				//
				//(10)
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение десять на расслабление. Встаньте на колени, верхнюю часть туловища наклоните вперед, руки вытяните вперед, затем сядьте на пятки. Во время упражнения сохраняйте спокойное равномерное дыхание."}},
				//{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Осторожно сгибайте и разгибайте шею, производя кивательные движения. Старайтесь растянуть шею. Держите три секунды."}},
				{{"1","раз по"},{"15","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох подняться"}}, 
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох опуститься"}},
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох подняться"}}, 
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох опуститься"}},
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох подняться"}}, 
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох опуститься"}},
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох подняться"}}, 
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох опуститься"}},
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох подняться"}}, 
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох опуститься"}},
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох подняться"}}, 
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох опуститься"}},
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох подняться"}}, 
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох опуститься"}},
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох подняться"}}, 
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох опуститься"}},
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох подняться"}}, 
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох опуститься"}},
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох подняться"}}, 
				{{"3","раз по"},{"(1,5*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох опуститься"}},
			}
		},
		//=====================
		//=========== катание с направлениями на цифры =====
	    {
			{{{"name","катание вокруг цифр"} ,{"id","катание_вокруг_цифр"}  ,{"parentid",""}}
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"},{"дата последнего выполнения",""} }},
			{{{"tags","хоккей#счетчики"}}},
			{{{"parameters"}
					,{"par000","float","скорость (%)","100","значение рассчитать по формуле",""}
					,{"par001","string","общее количество поворотов (в цикле до отдыха)","40","значение рассчитать по формуле",""}
					,{"par0011","string","количество секунд между поворотами","2","значение рассчитать по формуле",""}
					,{"par002","string","количество секунд отдыха (ЦЕЛОЕ)","15","значение рассчитать по формуле",""}
					,{"par021","string","пропорция 1","2","значение рассчитать по формуле",""}
					,{"par022","string","пропорция 2","2","значение рассчитать по формуле",""}
					,{"par023","string","пропорция 3","2","значение рассчитать по формуле",""}
					,{"par024","string","пропорция 4","2","значение рассчитать по формуле",""}
					,{"par025","string","пропорция 5","0","значение рассчитать по формуле",""}
					,{"par026","string","пропорция 6","0","значение рассчитать по формуле",""}
					,{"par027","string","пропорция 7","0","значение рассчитать по формуле",""}
					,{"par028","string","пропорция 8","0","значение рассчитать по формуле",""}
					,{"par029","string","пропорция 9","0","значение рассчитать по формуле",""}
					,{"par030","string","пропорция бросок","2","значение рассчитать по формуле",""}
					
								
				}       },

			{},{},{},{},{},{}, //резерв
			{   
				{{"par001","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","->33,34,35,36"}}, 
				{{"par002","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","отдых"}},   
				{{"par001","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","->33,34,35,36"}}, 
				{{"par002","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","отдых"}},
				{{"par001","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","->33,34,35,36"}}, 
				{{"par002","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","отдых"}},
				{{"par001","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","->33,34,35,36"}}, 
				{{"par002","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","отдых"}},
				{{"par001","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","->33,34,35,36"}}, 
				{{"par002","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","отдых"}},
			}
		},
		//=====================
	
		
		//=========== хоккей или фартлек на дороге =====

		{
			{{{"name","хоккей или фартлек на дороге"} ,{"id","фартлек1"}  ,{"parentid",""}}  
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""} }},
			{{{"tags","универсальные"}}},
			{{{"parameters"}
					//,{"par999","float","наименование тренировки","универсальный случайный счетчик до 10 видов команд","значение рассчитать по формуле",""}
					,{"par000","float","скорость (%)","100","значение рассчитать по формуле",""}
					,{"par001","string","общее количество упражнений","40","значение рассчитать по формуле",""}
					,{"par002","string","количество секунд отдыха (ЦЕЛОЕ)","15","значение рассчитать по формуле",""}
					
					,{"par011","string","команда упр 1","лицом направо","значение рассчитать по формуле",""}
					,{"par012","string","длительность упр 1 (сек)","2","значение рассчитать по формуле",""}
					,{"par013","string","пропорция упр 1","2","значение рассчитать по формуле",""}
					
					,{"par111","string","команда упр 1","улитка направо","значение рассчитать по формуле",""}
					,{"par112","string","длительность упр 1 (сек)","2","значение рассчитать по формуле",""}
					,{"par113","string","пропорция упр 1","2","значение рассчитать по формуле",""}
					
					,{"par021","string","команда упр 2","лицом налево","значение рассчитать по формуле",""}
					,{"par022","string","длительность упр 2 (сек)","2","значение рассчитать по формуле",""}
					,{"par023","string","пропорция упр 2","2","значение рассчитать по формуле",""}
					
					,{"par121","string","команда упр 2","улитка налево","значение рассчитать по формуле",""}
					,{"par122","string","длительность упр 2 (сек)","2","значение рассчитать по формуле",""}
					,{"par123","string","пропорция упр 2","2","значение рассчитать по формуле",""}
					
					,{"par031","string","команда упр 3","медленней","значение рассчитать по формуле",""}
					,{"par032","string","длительность упр 3 (сек)","2","значение рассчитать по формуле",""}
					,{"par033","string","пропорция упр 3","2","значение рассчитать по формуле",""}

					,{"par041","string","команда упр 4","быстрей","значение рассчитать по формуле",""}
					,{"par042","string","длительность упр 4 (сек)","2","значение рассчитать по формуле",""}
					,{"par043","string","пропорция упр 4","2","значение рассчитать по формуле",""}

					,{"par051","string","команда упр 5","стоп","значение рассчитать по формуле",""}
					,{"par052","string","длительность упр 5 (сек)","2","значение рассчитать по формуле",""}
					,{"par053","string","пропорция упр 5","1","значение рассчитать по формуле",""}

					,{"par061","string","команда упр 6","назад","значение рассчитать по формуле",""}
					,{"par062","string","длительность упр 6 (сек)","2","значение рассчитать по формуле",""}
					,{"par063","string","пропорция упр 6","1","значение рассчитать по формуле",""}
					
					,{"par161","string","команда упр 6","улитка назад","значение рассчитать по формуле",""}
					,{"par162","string","длительность упр 6 (сек)","2","значение рассчитать по формуле",""}
					,{"par163","string","пропорция упр 6","1","значение рассчитать по формуле",""}
					
					,{"par071","string","команда упр 7","кораблик спина лицо 1 раз","значение рассчитать по формуле",""}
					,{"par072","string","длительность упр 7 (сек)","3","значение рассчитать по формуле",""}
					,{"par073","string","пропорция упр 7","1","значение рассчитать по формуле",""}

					,{"par081","string","команда упр 8","спиной направо","значение рассчитать по формуле",""}
					,{"par082","string","длительность упр 8 (сек)","2","значение рассчитать по формуле",""}
					,{"par083","string","пропорция упр 8","1","значение рассчитать по формуле",""}

					,{"par091","string","команда упр 9","спиной налево","значение рассчитать по формуле",""}
					,{"par092","string","длительность упр 9 (сек)","2","значение рассчитать по формуле",""}
					,{"par093","string","пропорция упр 9","1" ,"значение рассчитать по формуле",""}

					,{"par101","string","команда упр 10","стоп назад","значение рассчитать по формуле",""}
					,{"par102","string","длительность упр 10 (сек)","2","значение рассчитать по формуле",""}
					,{"par103","string","пропорция упр 10","1","значение рассчитать по формуле",""}
				}       },
			
			{},{},{},{},{},{}, //резерв
			{   
				//{{"1","раз по"},{"10", "сек с дисперсией"},{"0"},{"сказать","первая цифра - положение корпуса. вторая цифра - положение шайбы"}}, 
    			{{"par001","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","->30"}}, 
				{{"par002","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","отдых"}},   
				{{"par001","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","->30"}}, 
				{{"par002","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","отдых"}},
				{{"par001","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","->30"}}, 
				{{"par002","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","отдых"}},
				{{"par001","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","->30"}}, 
				{{"par002","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","отдых"}},
				{{"par001","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","->30"}}, 
				{{"par002","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","отдых"}},

			}
		},

		//=====================
		//=========== универсальная настраиваемая 1 (случайные команды) =====

		{
			{{{"name","универсальный СЛУЧАЙНЫЙ счетчик до 10 видов команд"} ,{"id","универсальная_случайная_настраиваемая_1"}  ,{"parentid","шаблоны"}}
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"}  ,{"дата последнего выполнения",""} }},
			{{{"tags","универсальные"}}},
			{{{"parameters"}
					//,{"par999","float","наименование тренировки","универсальный случайный счетчик до 10 видов команд"}
					,{"par000","float","скорость (%)","100","значение рассчитать по формуле",""}
					,{"par001","string","общее количество упражнений","50","значение рассчитать по формуле",""}

					,{"par011","string","команда упр 1","1","значение рассчитать по формуле",""}
					,{"par012","string","длительность упр 1 (сек)","3","значение рассчитать по формуле",""}
					,{"par013","string","пропорция упр 1","1","значение рассчитать по формуле",""}

					,{"par021","string","команда упр 2","2","значение рассчитать по формуле",""}
					,{"par022","string","длительность упр 2 (сек)","3","значение рассчитать по формуле",""}
					,{"par023","string","пропорция упр 2","1","значение рассчитать по формуле",""}

					,{"par031","string","команда упр 3","3","значение рассчитать по формуле",""}
					,{"par032","string","длительность упр 3 (сек)","3","значение рассчитать по формуле",""}
					,{"par033","string","пропорция упр 3","1","значение рассчитать по формуле",""}

					,{"par041","string","команда упр 4","4","значение рассчитать по формуле",""}
					,{"par042","string","длительность упр 4 (сек)","3","значение рассчитать по формуле",""}
					,{"par043","string","пропорция упр 4","1","значение рассчитать по формуле",""}

					,{"par051","string","команда упр 5","5","значение рассчитать по формуле",""}
					,{"par052","string","длительность упр 5 (сек)","3","значение рассчитать по формуле",""}
					,{"par053","string","пропорция упр 5","1","значение рассчитать по формуле",""}

					,{"par061","string","команда упр 6","6","значение рассчитать по формуле",""}
					,{"par062","string","длительность упр 6 (сек)","3","значение рассчитать по формуле",""}
					,{"par063","string","пропорция упр 6","1","значение рассчитать по формуле",""}

					,{"par071","string","команда упр 7","7","значение рассчитать по формуле",""}
					,{"par072","string","длительность упр 7 (сек)","3","значение рассчитать по формуле",""}
					,{"par073","string","пропорция упр 7","1","значение рассчитать по формуле",""}

					,{"par081","string","команда упр 8","8","значение рассчитать по формуле",""}
					,{"par082","string","длительность упр 8 (сек)","3","значение рассчитать по формуле",""}
					,{"par083","string","пропорция упр 8","1","значение рассчитать по формуле",""}

					,{"par091","string","команда упр 9","9","значение рассчитать по формуле",""}
					,{"par092","string","длительность упр 9 (сек)","3","значение рассчитать по формуле",""}
					,{"par093","string","пропорция упр 9","1","значение рассчитать по формуле",""}

					,{"par101","string","команда упр 10","10","значение рассчитать по формуле",""}
					,{"par102","string","длительность упр 10 (сек)","3","значение рассчитать по формуле",""}
					,{"par103","string","пропорция упр 10","1","значение рассчитать по формуле",""}
				}       },

			{},{},{},{},{},{}, //резерв
			{   
				//{{"1","раз по"},{"10", "сек с дисперсией"},{"0"},{"сказать","первая цифра - положение корпуса. вторая цифра - положение шайбы"}}, 
    			{{"par001","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","->30"}},     

			}
		},
		//=========== универсальная настраиваемая 2 (последовательность команд) =====

		{
			{{{"name","универсальный счетчик до 10 видов команд"} ,{"id","универсальная_настраиваемая_1"}  ,{"parentid","шаблоны"} }
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""}}},
			{{{"tags","универсальные"}}},
			{{{"parameters"}
					//,{"par999","float","наименование тренировки","универсальный случайный счетчик до 10 видов команд"}
					,{"par000","float","скорость (%)","100","значение рассчитать по формуле",""}
					,{"par001","string","общее количество упражнений","50","значение рассчитать по формуле",""}

					,{"par011","string","команда упр 1","1","значение рассчитать по формуле",""}
					,{"par012","string","длительность упр 1 (сек)","3","значение рассчитать по формуле",""}
					,{"par013","string","количество повторений упр 1","1","значение рассчитать по формуле",""}

					,{"par021","string","команда упр 2","2","значение рассчитать по формуле",""}
					,{"par022","string","длительность упр 2 (сек)","3","значение рассчитать по формуле",""}
					,{"par023","string","количество повторений упр 2","1","значение рассчитать по формуле",""}

					,{"par031","string","команда упр 3","3","значение рассчитать по формуле",""}
					,{"par032","string","длительность упр 3 (сек)","3","значение рассчитать по формуле",""}
					,{"par033","string","количество повторений упр 3","1","значение рассчитать по формуле",""}

					,{"par041","string","команда упр 4","4","значение рассчитать по формуле",""}
					,{"par042","string","длительность упр 4 (сек)","3","значение рассчитать по формуле",""}
					,{"par043","string","количество повторений упр 4","1" ,"значение рассчитать по формуле",""}

					,{"par051","string","команда упр 5","5","значение рассчитать по формуле",""}
					,{"par052","string","длительность упр 5 (сек)","3","значение рассчитать по формуле",""}
					,{"par053","string","количество повторений упр 5","1","значение рассчитать по формуле",""}

					,{"par061","string","команда упр 6","6","значение рассчитать по формуле",""}
					,{"par062","string","длительность упр 6 (сек)","3","значение рассчитать по формуле",""}
					,{"par063","string","количество повторений упр 6","1","значение рассчитать по формуле",""}

					,{"par071","string","команда упр 7","7","значение рассчитать по формуле",""}
					,{"par072","string","длительность упр 7 (сек)","3","значение рассчитать по формуле",""}
					,{"par073","string","количество повторений упр 7","1","значение рассчитать по формуле",""}

					,{"par081","string","команда упр 8","8","значение рассчитать по формуле",""}
					,{"par082","string","длительность упр 8 (сек)","3","значение рассчитать по формуле",""}
					,{"par083","string","количество повторений упр 8","1","значение рассчитать по формуле",""}

					,{"par091","string","команда упр 9","9","значение рассчитать по формуле",""}
					,{"par092","string","длительность упр 9 (сек)","3","значение рассчитать по формуле",""}
					,{"par093","string","количество повторений упр 9","1","значение рассчитать по формуле",""}

					,{"par101","string","команда упр 10","10","значение рассчитать по формуле",""}
					,{"par102","string","длительность упр 10 (сек)","3","значение рассчитать по формуле",""}
					,{"par103","string","количество повторений упр 10","1","значение рассчитать по формуле",""}
				}       },

			{},{},{},{},{},{}, //резерв
			{   
				//{{"1","раз по"},{"10", "сек с дисперсией"},{"0"},{"сказать","первая цифра - положение корпуса. вторая цифра - положение шайбы"}}, 
    			{{"par013","раз по"},{"par012*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par011"}},
				{{"par023","раз по"},{"par022*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par021"}},     
				{{"par033","раз по"},{"par032*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par031"}},
				{{"par043","раз по"},{"par042*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par041"}},     
				{{"par053","раз по"},{"par052*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par051"}},
				{{"par063","раз по"},{"par062*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par061"}},     
				{{"par073","раз по"},{"par072*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par071"}},
				{{"par083","раз по"},{"par082*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par081"}},     
				{{"par093","раз по"},{"par092*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par091"}},
				{{"par103","раз по"},{"par102*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par101"}},     

			}
		},

		//=========== счетчик для роллерхок =====
	    {
			{{{"name","счет 1-4 номер квадрата + 1-4 номер квадрата шайбы "} ,{"id","роллерхоккей_счетчик"}  ,{"parentid",""}}
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"},{"дата последнего выполнения",""} }},
			{{{"tags","хоккей#счетчики"}}},
			{{{"parameters"}
					,{"par11","float","скорость (%)","100","значение рассчитать по формуле",""}
					,{"par02","string","комментарий к тренировке","","значение рассчитать по формуле",""}
					,{"par20","string","длительность пустого движения","1","значение рассчитать по формуле",""}
					,{"par00","string","пропорция пустого движения (ни броска ни перебежки)","4","значение рассчитать по формуле",""}
					,{"par3","string","перебежка (если не нужна - оставить пустое поле)","перебежка","значение рассчитать по формуле",""}
					,{"par4","string","длительность перебежка (сек)","2","значение рассчитать по формуле",""}
					,{"par5","string","пропорция перебежки ","3","значение рассчитать по формуле",""}
					,{"par06","string","бросок (если не нужен - оставить пустое поле)","бросок","значение рассчитать по формуле",""}
					,{"par61","string","длительность броска (сек)","3","значение рассчитать по формуле",""}
					,{"par7","string","пропорция броска ","3","значение рассчитать по формуле",""}
				}       },

			{},{},{},{},{},{}, //резерв
			{   
				//{{"1","раз по"},{"10", "сек с дисперсией"},{"0"},{"сказать","первая цифра - положение корпуса. вторая цифра - положение шайбы"}}, 
    			{{"150","раз по"},{"1","сек с дисперсией %"},{"40"},{"сказать","->26,26,27"}},     

			}
		},
		//=====================

		//=========== счетчик для роллерхок 2 =====
	    {
			{{{"name","счет 1-N  "} ,{"id","роллерхоккей_счетчик_1_N"}  ,{"parentid",""}}
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"}  ,{"дата последнего выполнения",""} }},
			{{{"tags","хоккей#счетчики"}}},
			{{{"parameters"}
					,{"par001","float","скорость (%)","100","значение рассчитать по формуле",""}
					,{"par2","string","комментарий к тренировки","","значение рассчитать по формуле",""}
					//,{"par3","string","1","1","значение рассчитать по формуле",""}
					,{"par004","string","длительность интервала(сек)","2","значение рассчитать по формуле",""}
					,{"par005","string","1","1","значение рассчитать по формуле",""}
					,{"par500","string","пропорция 1","1","значение рассчитать по формуле",""}
					,{"par006","string","2","2","значение рассчитать по формуле",""}
					,{"par600","string","пропорция 2","1","значение рассчитать по формуле",""}
					,{"par007","string","3","3","значение рассчитать по формуле",""}
					,{"par700","string","пропорция 3","1","значение рассчитать по формуле",""}
					,{"par008","string","4","4","значение рассчитать по формуле",""}
					,{"par800","string","пропорция 4","1","значение рассчитать по формуле",""}
					,{"par009","string","5","5","значение рассчитать по формуле",""}
					,{"par900","string","пропорция 5","0","значение рассчитать по формуле",""}
					//,{"par010","string","6","6"}
					//	,{"par1000","string","пропорция 6","0"}
					//,{"par5","string","пропорция перебежки (к 10)","3"} 
					//,{"par6","string","бросок (если не нужна - оставить пустое поле)","бросок"}
					//,{"par7","string","пропорция броска (к 10)","2"} 
				}       },

			{},{},{},{},{},{}, //резерв
			{   
				//{{"1","раз по"},{"10", "сек с дисперсией"},{"0"},{"сказать","первая цифра - положение корпуса. вторая цифра - положение шайбы"}}, 
    			{{"100","раз по"},{"par1","сек с дисперсией"},{"0"},{"сказать","->29"}},     

			}
		},
		//=====================

		//=========== табата 1 =====
	    {
			{{{"name","табата со случайными упражнениями (8 раз по 20 сек упр и 10 сек отдых)"} ,{"id","табата_случайные_упры"}  ,{"parentid",""}}
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""}}},
			{{{"tags","зарядка#"}}},
			{{{"parameters"},{"par1","float","интенсивность (%)","150","значение рассчитать по формуле",""}
					,{"par2","string","комментарий к тренировке","","значение рассчитать по формуле",""}
					//,{ "par3","string","перебежка (если не нужна - оставить пустой)","перебежка"}
					//,{"par4","string","длительность перебежка (сек)","3"}
					//,{"par5","string","пропорция перебежки (к 6)","1"}
				} },
			{},{},{},{},{},{}, //резерв
			{    
    			{{"20/(3*(100/par1))","раз по"},{"3*(100/par1)","сек с дисперсией"},{"0"},{"сказать","->28"}},     
				{{"5","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","отдых"}}, 
				{{"20/(3*(100/par1))","раз по"},{"3*(100/par1)","сек с дисперсией"},{"0"},{"сказать","->28"}},   
				{{"5","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","отдых"}}, 
				{{"20/(3*(100/par1))","раз по"},{"3*(100/par1)","сек с дисперсией"},{"0"},{"сказать","->28"}},     
				{{"5","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","отдых"}}, 
				{{"20/(3*(100/par1))","раз по"},{"3*(100/par1)","сек с дисперсией"},{"0"},{"сказать","->28"}},     
				{{"5","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","отдых"}}, 
				{{"20/(3*(100/par1))","раз по"},{"3*(100/par1)","сек с дисперсией"},{"0"},{"сказать","->28"}},     
				{{"5","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","отдых"}}, 
				{{"20/(3*(100/par1))","раз по"},{"3*(100/par1)","сек с дисперсией"},{"0"},{"сказать","->28"}},     
				{{"5","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","отдых"}}, 
				{{"20/(3*(100/par1))","раз по"},{"3*(100/par1)","сек с дисперсией"},{"0"},{"сказать","->28"}},     
				{{"5","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","отдых"}}, 
				{{"20/(3*(100/par1))","раз по"},{"3*(100/par1)","сек с дисперсией"},{"0"},{"сказать","->28"}},     
				{{"5","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","отдых"}}, 

			}
		},
		//=====================

		//===========хоккей =====
	    {
			{{{"name","хоккей 20 мин. 1 период в 2 пятерки"} ,{"id","хоккей_1пер_2пят"}  ,{"parentid",""}}
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"},{"дата последнего выполнения",""} }},
			{{{"tags","хоккей#"}}},
			{{{"parameters"},{"par1","string","комментарий к тренировке","","значение рассчитать по формуле",""}
				}       },
			
			{},{},{},{},{},{}, //резерв
			{   
				{{"1","раз по"},{"5", "сек с дисперсией"},{"0"},{"сказать","хоккей один период в две пятерки"}}, 
				{{"18","раз по"},{"10","сек с дисперсией"},{"0"},{"сказать","->4,4,7,8"}},     //катание 3 мин 
				{{"1","раз по"},{"3", "сек с дисперсией"},{"0"},{"сказать","Смена. Броски"}},
				{{"1","раз по"},{"15", "сек с дисперсией"},{"0"},{"сказать",""}},
				{{"20","раз по"},{"9","сек с дисперсией"},{"0"},{"сказать","->15,14,5,6"}},    //броски 3 мин

				{{"1","раз по"},{"5", "сек с дисперсией"},{"0"},{"сказать","Смена.Катание"}}, 
				{{"18","раз по"},{"10","сек с дисперсией"},{"0"},{"сказать","->4,4,16,17"}},     //катание 3 мин (16 скорость 17 бросок)
				{{"1","раз по"},{"3", "сек с дисперсией"},{"0"},{"сказать","Смена. Броски"}},
				{{"1","раз по"},{"15", "сек с дисперсией"},{"0"},{"сказать",""}},
				{{"20","раз по"},{"9","сек с дисперсией"},{"0"},{"сказать","->15,14,5,6"}},    //броски 3 мин

				{{"1","раз по"},{"5", "сек с дисперсией"},{"0"},{"сказать","Смена.Катание"}}, 
				{{"18","раз по"},{"10","сек с дисперсией"},{"0"},{"сказать","->4,4,24,25"}},     //катание 3 мин (24 маневр 25 пас)
				{{"1","раз по"},{"3", "сек с дисперсией"},{"0"},{"сказать","Смена. Броски"}},
				{{"1","раз по"},{"15", "сек с дисперсией"},{"0"},{"сказать",""}},
				{{"20","раз по"},{"9","сек с дисперсией"},{"0"},{"сказать","->15,14,5,6"}},    //броски 3 мин

				{{"1","раз по"},{"3", "сек с дисперсией"},{"0"},{"сказать","Период завершен."}}, 

			}
		},
		//=====================
		//===========дых лесенка - вдох = выдоху, доводим от минимального до максимального и обратно =====

	    {
			{{{"name","дыхательная лесенка "},{"id","дых_лесенка"}  ,{"parentid",""} }
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""} }},
			{{{"tags","дых#"}}},
			{{{"parameters"}//,{"par1","string","комментарий к тренировке",""}
					,{"par2min","float","минимальная длительность вдоха и выдоха,сек","5","значение рассчитать по формуле",""}
					,{"par3max","float","максимальная длительность вдоха и выдоха,сек","10","значение рассчитать по формуле","rithmLinearFromDate2DateByNow(на текущую дату_линейно от даты, 01.09.2020, от значения, 10, до даты,01.09.2023, до значения, 20)"}
					,{"par4T","float","длительность тренировки,сек","240","значение рассчитать по формуле",""}
				}       },
			{},{},{},{},{},{}, //резерв
			// {{"param1","descreat","<min>","<max>"},{"param2","descreat","<min>","<max>"},}
			{   
				//{{"1500"},{"прошлосек+1"},{"0"},{"1"}},
				{{"8*par4T / (par2min + par3max)"},{"1"},{"0"},{"сказать","->31"}},
				{{"8*par4T / (par2min + par3max)"},{"1"},{"0"},{"сказать","->32"}},
			}

		},
		
		//===========дых -1 =====

	    {
			{{{"name","экспер 110011100 медленнаяая дыхательная (220+ 120*sin(3.14*полноевремя(0)/780))/(2*3*60) "},{"id","экспер_дых_ур1"}   ,{"parentid","шаблоны"}}
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{"showInSpinner","0"},{"повторить,раз","1"},{"отсрочка старта,сек","5"}  ,{"дата последнего выполнения",""} }},
			{{{"tags","дых#"}}},
			{{{"parameters"},
					{"par1","string","комментарий к тренировке","","значение рассчитать по формуле",""}
					// {"par2","string","комментарий к тренировке",""},

				}       },

			{},{},{},{},{},{}, //резерв
			// {{"param1","descreat","<min>","<max>"},{"param2","descreat","<min>","<max>"},}
			{   
				//{{"1500"},{"прошлосек+1"},{"0"},{"1"}},
				{{"1500"},{"0.5"},{"0"},{"сказать","->2"}},
			}

		},
		//======================
		//===========дых 0 =====

	    {
			{{{"name","медленнаяая дыхательная (100/скорость)(220+ 120*sin(3.14*по-лноевремя(0)/780))/(2*3*60) "},{"id","медл_дых_ур1"}  ,{"parentid","шаблоны"} }
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""} }},
			{{{"tags","дых#"}}},
			{{{"parameters"},{"par1","string","комментарий к тренировке","","значение рассчитать по формуле",""}
					,{"par2","float","скорость (%)","100","значение рассчитать по формуле",""}
				}       },

			{},{},{},{},{},{}, //резерв
			// {{"param1","descreat","<min>","<max>"},{"param2","descreat","<min>","<max>"},}
			{   
				//{{"1500"},{"прошлосек+1"},{"0"},{"1"}},
				{{"1500"},{"(100/par2)*((250+ 120*sin(3.14*полноевремя(0)/1000))/(2*3*60))"},{"0"},{"сказать","->1"}},
			}

		},


		//===========бег 180+- =====
	    {
			{{{"name","бег частота 180 плюс минус 10"} ,{"id","тест_бег_ур1"}  ,{"parentid",""}}
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""}}},
			{{{"tags","дых#бег#"}}},
			{{{"parameters"},{"par1","string","комментарий к тренировке","","значение рассчитать по формуле",""}
					,{"par2","float","скорость (%)","100","значение рассчитать по формуле",""}
				}       },

			{},{},{},{},{},{}, //резерв
			{   
				//{{"5500"},{" (180+"},{"0"},{"1"}},
				{{"5500"},{"(100/par2)*((840+ 0*sin(3.14*полноевремя(0)/500))/(2*3*60))"},{"0"},{"сказать","->1"}},
			}
		},
		//=====================

		//===========уборка =====
	    {
			{{{"name","уборка"} ,{"id","уборка"}  ,{"parentid",""}}
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{"showInSpinner","bernulli01(0.5)"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""}}},
			{{{"tags",""}}},
			{{{"parameters"}
				}       },

			{},{},{},{},{},{}, //резерв
			{   
				//{{"5500"},{" (180+"},{"0"},{"1"}},
				{{"3"},{"2"},{"0"},{"сказать","уборка дома"}},
			}
		},
		//=====================


		//===========дух чтение =====
	    {
			{{{"name","дух чтение"} ,{"id","духчтение"}  ,{"parentid",""}}
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{"showInSpinner","bernulli01(0.2)"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""}}},
			{{{"tags",""}}},
			{{{"parameters"}
				}       },

			{},{},{},{},{},{}, //резерв
			{   
				//{{"5500"},{" (180+"},{"0"},{"1"}},
				{{"3"},{"2"},{"0"},{"сказать","уборка дома"}},
			}
		},
		//=====================







	};

	/*
	 {°°°,{°°,{°,{•,《name》,《разминка амосова》,}•,{•,《id》,《медл_дых_ур2》,}•,}°,}°°,
	 {°°,{°,{•,《showInSpinner》,《0》,}•,}°,}°°,
	 {°°,{°,{•,《tags》,《дых#для ходьбы#в покое#тест#》,}•,}°,}°°,
	 {°°,}°°,
	 {°°,}°°,
	 {°°,}°°,
	 {°°,}°°,
	 {°°,}°°,
	 {°°,}°°,
	 {°°,}°°,
	 {°°,{°,{•,《1》,}•,{•,《4》,}•,{•,《0》,}•,{•,《сказать》,《разминка амосова》,}•,}°,{°,{•,《1》,}•,{•,《7》,}•,{•,《0》,}•,{•,《сказать》,《》,}•,}°,{°,{•,《20》,}•,{•,《(200+ 50*номеритерации1)/1000》,}•,{•,《0》,}•,{•,《сказать》,《а》,}•,}°,}°°,
	 }°°°,
	 */

	//=====================

	public String[][][][]  aDeals100Init =
	{   //==  для дыхательных  ======
		/*0*/{{{"name","ссылка12"},{"id","ссылкатест"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","->1,2","С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:", "1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}}},
	    /*1*/{{{"name","сказать о или ы1"},{"id","вдохвыдох1"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","iif(остатокделна4(номеритерации1)-1,о,ы)" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}}},
	    /*2*/{{{"name","сказать о или ы2"},{"id"," вдохвыдох2"}}, {{   "ОБЩАЯ ФРАЗА",""},{"СКАЗАТЬ:", "iif(grdssin(номеритерации1*20*grdssin(номеритерации1/80)),о,ы)" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}}},
	    /*3*/{{{"name","сказать о или ы3"},{"id"," вдохвыдох3"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","iif(остатокделна4(номеритерации1),о,ы)" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}}},

	    //==  для хоккея  ==========
		/*4*/{{{"name","ближний1 средний1 дальний1"},{"id","ближний1_средний1_дальний1"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","ближний" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:", "средний" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","дальний" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
		/*5*/{{{"name","вверх1 центр1 вниз1"},{"id","вверх1_центр1_вниз1"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","вверх" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","центр" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","вниз" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" } }},
		/*6*/{{{"name","влево1 центр1 вправо1"},{"id","влево1_центр1_вправо1"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","влево" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","центр" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },{ "СКАЗАТЬ:","вправо" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
		/*7*/{{{"name","слева1 пусто2 справа1"},{"id","слева1_пусто2_справа1"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","объехать слева" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","объехать справа" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" } }},
		/*8*/{{{"name","пас3 пусто4 бросок3"},{"id","пас3_пусто4_бросок3"}}, {{  "ОБЩАЯ ФРАЗА", ""},{  "СКАЗАТЬ:","пас" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","4"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
		/*9*/{{{"name","щелчок1 бросок4 кистевой2"},{"id","щелчок1_бросок4_кистевой2"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","щелчок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{"СКАЗАТЬ:","бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","4" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },{ "СКАЗАТЬ:","кистевой" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},}},
		/*10*/{{{"name","с удобной3 с неудобной1"},{"id","судобной3_снеудобной1"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","с неудобной" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
		/*11*/{{{"name","бросок2 кистевой1"},{"id","бросок2_кистевой1"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{"СКАЗАТЬ:","кистевой" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},}},
		/*12*/{{{"name","щелчок"},{"id","щелчок_1"}}, {{  "ОБЩАЯ ФРАЗА", ""},{"СКАЗАТЬ:", "щелчок" ,"1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},}},
		/*13*/{{{"name","(бросок2 кистевой1)(удобн3 неудобн1)"},{"id","(бросок2_кистевой1)(удоб3_неудоб1)"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","->11,10" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },}},
		/*14*/{{{"name","щелчок1 (бросок2 кистевой1)(удобн3 неудобн1)3"},{"id","щелчок1_(бросок2_кистевой1)(удоб3_неудоб1)_1"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","щелчок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},  { "СКАЗАТЬ:","->13","С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},}},
		/*15*/{{{"name","ближняя2 дальная1 средняя2 дист"},{"id","ближ2_даль1_сред2"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","ближняя дистанция" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" }  ,{ "СКАЗАТЬ:","средняя дистанция" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}  ,{ "СКАЗАТЬ:","дальняя дистанция" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" } ,}},
		//с акцентами
		//1
		/*16*/{{{"name","слева1 пусто6 справа1 (скорость)"},{"id","слева1_пусто6_справа1(скорость)"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","объехать слева" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{  "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","6" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","объехать справа" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
		/*17*/{{{"name","пас3 пусто3 бросок7(бросок)"},{"id","пас3_пусто3_бросок7(бросок)"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","пас" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },{  "СКАЗАТЬ:","","С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },{ "СКАЗАТЬ:","бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","7" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" } }},
		/*18*/{{{"name","щелчок7 бросок3 кистевой2(щелчок)"},{"id","щелчок7_бросок3_кистевой2(щелчок)"}}, {{  "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","щелчок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","7" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },{  "СКАЗАТЬ:","бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","кистевой" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },}},
		/*19*/{{{"name","с удобной1 с неудобной2(неудобная"},{"id","судобной1_снеудобной2(неудобная)"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },{"СКАЗАТЬ:", "с неудобной" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" } }},
		/*20*/{{{"name","бросок1 кистевой3(кистевой)"},{"id","бросок1_кистевой3(кистевой)"}}, {{  "ОБЩАЯ ФРАЗА",""},{  "СКАЗАТЬ:","бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },{ "СКАЗАТЬ:", "кистевой" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},}},
		/*21*/{{{"name","РЕЗЕРВ(бросок2 кистевой1)(удобн3 неудобн1)"},{"id","(РЕЗЕРВбросок2_кистевой1)(удоб3_неудоб1)"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","->11,10" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },}},
		/*22*/{{{"name","РЕЗЕРВщелчок1 (бросок2 кистевой1)(удобн3 неудобн1)3"},{"id","РЕЗЕРВщелчок1_(бросок2_кистевой1)(удоб3_неудоб1)_1"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","щелчок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },  { "СКАЗАТЬ:","->13" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },}},
		/*23*/{{{"name","ближняя1 дальная4 средняя1 дист(дальняя)"},{"id","ближ1_даль4_сред1(дальняя)"}}, {{  "ОБЩАЯ ФРАЗА",""},{"СКАЗАТЬ:",  "ближняя дистанция" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" }  ,{  "СКАЗАТЬ:", "средняя дистанция" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" }  ,{  "СКАЗАТЬ:", "дальняя дистанция" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","4" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" } ,}},
		//2
		/*24*/{{{"name","слева2 пусто1 справа2 (маневр)"},{"id","слева2_пусто1_справа2(маневр)"}}, {{   "ОБЩАЯ ФРАЗА",""},{  "СКАЗАТЬ:", "объехать слева" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:", "" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{  "СКАЗАТЬ:", "объехать справа" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
		/*25*/{{{"name","пас7 пусто3 бросок3(пас)"},{"id","пас7_пусто3_бросок3(пас)"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:",  "пас" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","7" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{  "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{  "СКАЗАТЬ:", "бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
		/*26*/{{{"name","счетчик роллерхокк корпус шайба"},{"id","счетчик_роллерхок"}}, {{ "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","1","С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1","ДЛИТЕЛЬНОСТЬ (СЕК):","par20*(100/par11)"},{ "СКАЗАТЬ:","2" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1","ДЛИТЕЛЬНОСТЬ (СЕК):","par20*(100/par11)" },{  "СКАЗАТЬ:","3" , "С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","par20*(100/par11)"},{  "СКАЗАТЬ:","4", "С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","par20*(100/par11)"}  }},//,{"5" ,"1"},{ "6" ,"1"} ,{ "7" ,"1"},{"8" ,"1"},{ "9" ,"1"} }},
		/*27*/{{{"name","счетчик роллерхокк  перебежка "},{"id","счетчик_роллерхок_перебежка"}}, {{ "ОБЩАЯ ФРАЗА",""}
		        ,{  "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par00" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","0.01"}
				,{  "СКАЗАТЬ:","par3" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" , "par5" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","par4*(100/par11)"} 
				,{  "СКАЗАТЬ:","par06" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" , "par7" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","par61*(100/par11)"} 
			}},//,{"5" ,"1"},{ "6" ,"1"} ,{ "7" ,"1"},{"8" ,"1"},{ "9" ,"1"} }},
		/*28*/{{{"name","табата со случайными упр"},{"id","табата_случ_упр"}}, {{ "ОБЩАЯ ФРАЗА",""}
		        ,{  "СКАЗАТЬ:","подпрыгнуть на правой" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
				,{  "СКАЗАТЬ:","подпрыгнуть на левой" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
				,{  "СКАЗАТЬ:","подтянуться" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" , "1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"} 
				,{  "СКАЗАТЬ:","отжаться на пальцах" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
				,{  "СКАЗАТЬ:","левый пистолетик" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
				,{  "СКАЗАТЬ:","правый пистолетик" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
				,{  "СКАЗАТЬ:","книжка" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"""}//"}
				,{  "СКАЗАТЬ:","лодочка" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
				,{  "СКАЗАТЬ:","левая лодочка" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
				,{  "СКАЗАТЬ:","правая лодочка" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
				,{  "СКАЗАТЬ:","встать на руки" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
				,{  "СКАЗАТЬ:","курочка" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
			}},//,{"5" ,"1"},{ "6" ,"1"} ,{ "7" ,"1"},{"8" ,"1"},{ "9" ,"1"} }},

		/*29*/{{{"name","счетчик 1-N"},{"id","счетчик_1_N"}}, {{ "ОБЩАЯ ФРАЗА",""}
		        ,{ "СКАЗАТЬ:","par005" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par500","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par001)" }
	            ,{ "СКАЗАТЬ:","par006" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par600","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par001)" }
				,{ "СКАЗАТЬ:","par007" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par700","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par001)" }
				,{ "СКАЗАТЬ:","par008" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par800","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par001)" }
				,{ "СКАЗАТЬ:","par009" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par900","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par001)" }
				//,{ "СКАЗАТЬ:","par010" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par1000","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par1)" }
		    }},//,{"5" ,"1"},{ "6" ,"1"} ,{ "7" ,"1"},{"8" ,"1"},{ "9" ,"1"} }},

		/*30*/{{{"name","универсальная 1-10"},{"id","универсальная_1_10"}}, {{ "ОБЩАЯ ФРАЗА",""}
		        ,{ "СКАЗАТЬ:","par011" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par013","ДЛИТЕЛЬНОСТЬ (СЕК):","  par012*(100/par000)" }
				,{ "СКАЗАТЬ:","par111" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par113","ДЛИТЕЛЬНОСТЬ (СЕК):","  par112*(100/par000)" }
				
				,{ "СКАЗАТЬ:","par021" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par023","ДЛИТЕЛЬНОСТЬ (СЕК):","  par022*(100/par000)" }
				,{ "СКАЗАТЬ:","par121" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par123","ДЛИТЕЛЬНОСТЬ (СЕК):","  par122*(100/par000)" }
				
				,{ "СКАЗАТЬ:","par031" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par033","ДЛИТЕЛЬНОСТЬ (СЕК):","  par032*(100/par000)" }
				,{ "СКАЗАТЬ:","par041" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par043","ДЛИТЕЛЬНОСТЬ (СЕК):","  par042*(100/par000)" }
				,{ "СКАЗАТЬ:","par051" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par053","ДЛИТЕЛЬНОСТЬ (СЕК):","  par052*(100/par000)" }
				//,{ "СКАЗАТЬ:","par010" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par1000","ДЛИТЕЛЬНОСТЬ (СЕК):","  par012*(100/par1)" }
				,{ "СКАЗАТЬ:","par061" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par063","ДЛИТЕЛЬНОСТЬ (СЕК):","  par062*(100/par000)" }
				,{ "СКАЗАТЬ:","par161" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par163","ДЛИТЕЛЬНОСТЬ (СЕК):","  par162*(100/par000)" }
				
				,{ "СКАЗАТЬ:","par071" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par073","ДЛИТЕЛЬНОСТЬ (СЕК):","  par072*(100/par000)" }
				,{ "СКАЗАТЬ:","par081" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par083","ДЛИТЕЛЬНОСТЬ (СЕК):","  par082*(100/par000)" }
				,{ "СКАЗАТЬ:","par091" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par093","ДЛИТЕЛЬНОСТЬ (СЕК):","  par092*(100/par000)" }
				,{ "СКАЗАТЬ:","par101" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par103","ДЛИТЕЛЬНОСТЬ (СЕК):","  par102*(100/par000)" }

		    }},
			
		///*31*/{{{"name","сказать вдох или выдох4"},{"id"," вдохвыдох4"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","iif(нечетное(целоеделна4(номеритерации1)),ы,о)" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):"," (par2min + (номеритерации1/8-1) * (par3max-par2min)/((1*par4T/(par3max + par2min))-1) )/8"}}},
		/*31*/{{{"name","сказать вдох или выдох4"},{"id"," вдохвыдох4"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","iif(нечетное(целоеделна4(номеритерации1)),ы,о)" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):"," (par2min + (номеритерации1/8-0) * (par3max-par2min)/((1*par4T/(par3max + par2min))-0) )/8"}}},
		
	//	/*32*/{{{"name","сказать вдох или выдох41"},{"id"," вдохвыдох41"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","iif(нечетное(целоеделна4(номеритерации1)),ы,о)" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):"," (par3max + ( 1*par4T / (par2min + par3max) - номеритерации1/8+1) * (par3max-par2min)/((1*par4T/(par3max + par2min))-1) )/8"}}},
		/*32*/{{{"name","сказать вдох или выдох41"},{"id"," вдохвыдох41"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","iif(нечетное(целоеделна4(номеритерации1)),ы,о)" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):"," (par3max + ( 1*par4T / (par2min + par3max) - номеритерации1/8+0) * (par3max-par2min)/((1*par4T/(par3max + par2min))-1) )/8"}}},
		
		/*33*/{{{"name","1-9"},{"id","1_9"}}, {{ "ОБЩАЯ ФРАЗА",""}
		        ,{ "СКАЗАТЬ:","1" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par021","ДЛИТЕЛЬНОСТЬ (СЕК):","  par0011*(100/par000)" }
	            ,{ "СКАЗАТЬ:","2" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par022","ДЛИТЕЛЬНОСТЬ (СЕК):","  par0011*(100/par000)" }
				,{ "СКАЗАТЬ:","3" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par023","ДЛИТЕЛЬНОСТЬ (СЕК):","  par0011*(100/par000)" }
				,{ "СКАЗАТЬ:","4" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par024","ДЛИТЕЛЬНОСТЬ (СЕК):","  par0011*(100/par000)" }
				,{ "СКАЗАТЬ:","5" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par025","ДЛИТЕЛЬНОСТЬ (СЕК):","  par0011*(100/par000)" }
				//,{ "СКАЗАТЬ:","par010" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par1000","ДЛИТЕЛЬНОСТЬ (СЕК):","  par012*(100/par1)" }
				,{ "СКАЗАТЬ:","6" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par026","ДЛИТЕЛЬНОСТЬ (СЕК):","  par0011*(100/par000)" }
	            ,{ "СКАЗАТЬ:","7" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par027","ДЛИТЕЛЬНОСТЬ (СЕК):","  par0011*(100/par000)" }
				,{ "СКАЗАТЬ:","8" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par028","ДЛИТЕЛЬНОСТЬ (СЕК):","  par0011*(100/par000)" }
				,{ "СКАЗАТЬ:","9" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par029","ДЛИТЕЛЬНОСТЬ (СЕК):","  par0011*(100/par000)" }
				//,{ "СКАЗАТЬ:","бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par030","ДЛИТЕЛЬНОСТЬ (СЕК):","  par0011*(100/par000)" }
				
		    }},
		/*34*/{{{"name","лицо-спина-стоп-кораблик"},{"id","лицо-спина-стоп-кораблик"}}, {{ "ОБЩАЯ ФРАЗА",""}
		        ,{ "СКАЗАТЬ:","лицо" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"4","ДЛИТЕЛЬНОСТЬ (СЕК):","  par0011*(100/par000)" }
	            ,{ "СКАЗАТЬ:","спина" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1","ДЛИТЕЛЬНОСТЬ (СЕК):","  par0011*(100/par000)" }
    			,{ "СКАЗАТЬ:","улитка" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2","ДЛИТЕЛЬНОСТЬ (СЕК):","  par0011*(100/par000)" }
				,{ "СКАЗАТЬ:","кораблик" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1","ДЛИТЕЛЬНОСТЬ (СЕК):","  par0011*(100/par000)" }
				
				}},
		/*35*/{{{"name","лицо-спина-стоп-кораблик"},{"id","лицо-спина-стоп-кораблик"}}, {{ "ОБЩАЯ ФРАЗА",""}
		     	,{ "СКАЗАТЬ:","справа" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1","ДЛИТЕЛЬНОСТЬ (СЕК):","0" }
				,{ "СКАЗАТЬ:","слева" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1","ДЛИТЕЛЬНОСТЬ (СЕК):","0" }

			}},
		/*36*/{{{"name","стоп-быстрей-медленней"},{"id","стоп-быстрей-медленней"}}, {{ "ОБЩАЯ ФРАЗА",""}
		        ,{ "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"3","ДЛИТЕЛЬНОСТЬ (СЕК):","0" }
				,{ "СКАЗАТЬ:","стоп" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1","ДЛИТЕЛЬНОСТЬ (СЕК):","0" }
				,{ "СКАЗАТЬ:","быстрей" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1","ДЛИТЕЛЬНОСТЬ (СЕК):","0" }
				,{ "СКАЗАТЬ:","медленней" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1","ДЛИТЕЛЬНОСТЬ (СЕК):"," 0" }
				,{ "СКАЗАТЬ:","бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par030","ДЛИТЕЛЬНОСТЬ (СЕК):"," 0" }
				
			}},
		/*37*/{{{"name","улитка"},{"id","улитка"}}, {{ "ОБЩАЯ ФРАЗА",""}
		     	,{ "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2","ДЛИТЕЛЬНОСТЬ (СЕК):","0" }
				,{ "СКАЗАТЬ:","улитка" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1","ДЛИТЕЛЬНОСТЬ (СЕК):","0" }

			}},
		/*38*/{{{"name","вдох"},{"id","вдох"}}, {{ "ОБЩАЯ ФРАЗА","вдох"}
			}},
		/*39*/{{{"name","тянем"},{"id","тянем"}}, {{ "ОБЩАЯ ФРАЗА","тянем"}
			}},
		/*40*/{{{"name","напрягаем"},{"id","напрягаем"}}, {{ "ОБЩАЯ ФРАЗА","напрягаем"}
			}},
		/*41*/{{{"name","наклоняем вниз"},{"id","наклоняем вниз"}}, {{ "ОБЩАЯ ФРАЗА","выдох, наклоняем вниз"}
			}},
		
		
			

	};




	//>>>>>>>>>>>>>>>>>>>>>>


}
/*
		//=========== упражнения на шейный отдел позвоночника =====
	    {
			{{{"name","позвоночник шея"} ,{"id","позвоночник_шея"}  ,{"parentid",""}}
				,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			},
			{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"},{"дата последнего выполнения",""} }},
			{{{"tags","спина#"}}},
			{{{"parameters"}
					,{"par000","float","скорость (%)","100","значение рассчитать по формуле",""}
				
				}       },

			{},{},{},{},{},{}, //резерв
			{   
			//время берет из прошлого упра !
			   //{{"1","раз по"},{"11","сек с дисперсией"},{"0"},{"сказать","Упражнения для шейного отдела позвоночника. Каждое упражнение делать после вдоха, на выдохе. После выдоха держать-растягиваь мышцы на задержке дыхания."}},
				//{{"1","раз по"},{"20","сек с дисперсией"},{"0"},{"сказать",""}},
				//сгибания
				{{"1","раз по"},{"6","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение один, Сгибание шеи"}},
				//{{"1","раз по"},{"6","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Наклоните голову вниз, Держите три секунды и вернитесь в исходное положение"}},
				{{"1","раз по"},{"5","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1,0*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1,0*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1,0*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1,0*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1,0*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1,0*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1,0*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1,0*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				//разгибания
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение два, разгибание шеи"}},
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Наклоните голову назад, Держите три секунды и вернитесь в исходное положение"}},
				{{"1","раз по"},{"5","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				
				//повороты
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение три, повороты шеи"}},
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Медленно поворачивайте шею чтобы увидеть левое плечо, Затем также направо, Держите три секунды и вернитесь в исходное положение"}},
				{{"1","раз по"},{"9","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				//растяжения шеи
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение четыре, растяжение шеи"}},
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Удерживайте вытянутую вниз руку в области запястья противоположной рукой. Осторожно поверните голову в сторону удерживающей руки. Держите три секунды и вернитесь в исходное положение. Затем поменять руки и повторить в другую сторону.  "}},
				{{"1","раз по"},{"16","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				//ретракции
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение пять, ретракции шеи"}},
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Отклоните голову назад сохраняя уровень нижней челюсти. Держите три секунды и вернитесь в исходное положение"}},
				{{"1","раз по"},{"9","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				//пожимания плечами
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение шесть, пожимание плечами"}},
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Движение плечами вверх и вниз, затем вперед и назад.  "}},
				{{"1","раз по"},{"10","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вниз"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вниз"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вниз"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вниз"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вниз"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вниз"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вниз"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вниз"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вниз"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вверх"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вниз"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				//{{"3","раз по"},{"(1,3*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}},
				//растяжения трапецевидной мышцы
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение семь, растяжение трапецевидной мышцы"}},
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Положите левую руку на голову. Медленно потяните рукой шею влево, Затем также вправо другой рукой. Держите три секунды"}},
				{{"1","раз по"},{"10","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				//сгибания и разгибания шеи
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение восемь, сгибание и разгибание шеи"}},
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Осторожно сгибайте и разгибайте шею, производя кивательные движения. Старайтесь растянуть шею. Держите три секунды."}},
				{{"1","раз по"},{"9","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох вперед"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","тянем"}}, 
			    //
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнения для укрепления шейных мышц"}},
				//потягивания
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Упражнение один, потягивания"}},
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Руку расположите на затылке. Отведите голову назад оказывая рукой сопротивление. Держите три секунды и вернитесь в исходное положение"}},
				{{"1","раз по"},{"9","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох назад"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				//боковое сгибание
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение два, боковое сгибание"}},
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Рука поддерживает голову сбоку. Наклоните голову вбок оказывая руке сопротивление. Держите три секунды"}},
				{{"1","раз по"},{"9","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				//сгибание
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение три, сгибание"}},
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Удерживайте лоб кончиками пальцев. Наклоняйте голову назад оказывая рукой сопротивление. Держите три секунды и вернитесь в исходное положение"}},
				{{"1","раз по"},{"11","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох согнуть"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				//ротация
				{{"1","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","Упражнение четыре, ротация"}},
				{{"1","раз по"},{"3","сек с дисперсией"},{"0"},{"сказать","Поместите кончики пальцев на висок. Поворачивайте голову стараясь увидеть шею. Рука оказывает сопротивление. Держите три секунды"}},
				{{"1","раз по"},{"9","сек с дисперсией"},{"0"},{"сказать",""}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох налево"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","вдох"}}, 
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","выдох направо"}},
				{{"3","раз по"},{"(1*100/par000)","сек с дисперсией"},{"0"},{"сказать","напрячь"}}, 
				
				
			}
		},

*/
