package com.mycompany.myapp;
	import android.app.*;
	import android.os.*;
//
//import android.speech.tts.*;
	import android.util.*;
	import android.view.View;
	import android.view.View.OnClickListener;
	import android.widget.*;
	import java.util.*;
	import android.content.*;
	import android.speech.tts.*;
	import android.content.*;


	public class dataBaseInit 
	{ /*
		protected SharedPreferences mSettings;
		protected SharedPreferences mSettingsData;
		final String sDel1 ="》,"; 
		final String sDel2 ="}•,";
		final String sDel3 ="}°,";
		final String sDel4 ="}°°,";
		final String sDel5 ="}°°°,";

		final String sBegDel1 ="《";  
		final String sBegDel2 ="{•,";
		final String sBegDel3 ="{°,";
		final String sBegDel4 ="{°°,";
		final String sBegDel5 ="{°°°,";

		final String SET_FILE_NAME = "coachsettings_test2";
		final String SET_TRAIN_INDEX = "trainindex";
		final String SET_TRAIN_ID = "trainid";

		//<<для сброса настроек, чтобы вернуться к чтению данных из массивов в этом классе, изменить имена ниже
		final String SET_AMETARITHM_FILE_NAME = "ametarithmanddeals_tmp36";
		final String SET_AMETARITHM_BCK1_FILE_NAME = "bck1_ametarithmanddeals_tmp36";
		//>>

		final String SET_AMETARITHM = "ametarithm";
		final String SET_ARITHM = "arithm";
		final String SET_ADEALS100 = "adeals100";
		final String DELIMITER = "\n\n<THIS IS DELIMITER>\n\n";

		protected String sAMetaRithm="";
		protected String sARithm="";
		protected String sADeals100="";
		*/
		protected int Gl_SelectedIndexInit = 0;


	    protected String sAMetaRithmD="";
	    protected String sARithmD="";
		protected String[][][][][][] aMetaMetaRithmD;
		protected String[][][][][] aRithmD;
	/*
		protected String[][][][] aDeals100;

		protected void onCreate(Bundle savedInstanceState)
		{

		}


		*/

//#####################################################
//####    БАЗА ДАННЫХ ПО УМОЛЧАНИЮ    #########	
//#####################################################	
		public String[][][][][][]  aMetaRithmDInit = 
		{  

			//=====================
			//================Шаблоны для копирования  ( верхний уровень)
			{ 
			  {
				{{{"name","Шаблоны тренировок"} ,{"id","шаблоны"}  ,{"parentid",""}}
					,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
				},
				{{{  "showInSpinner","0" } ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""}}},
				{{{"tags",""}}},
				{{{"parameters"}
					}       },

				{},{},{},{},{},{}, //резерв
				{   
					//{{"5500"},{" (180+"},{"0"},{"1"}},
					//{{"3"},{"2"},{"0"},{"сказать","уборка дома"}},
				}
			  }
			  ,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},
			  
			  }
			},
			//=====================
			/*
			 //================Утренняя тренировка  ( верхний уровень)
			 {
			 {
			 {{{"name","Утренняя тренировка"} ,{"id","утреннняя_тренировка"}  ,{"parentid",""}}
			 ,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			 },
			 {{{  "showInSpinner","0"  } ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""}}},
			 {{{"tags",""}}},
			 {{{"parameters"}
			 }       },

			 {},{},{},{},{},{}, //резерв
			 {   
			 //{{"5500"},{" (180+"},{"0"},{"1"}},
			 //{{"3"},{"2"},{"0"},{"сказать","уборка дома"}},
			 }
			 }
			 ,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},

			 }
			 },
			 //=====================
			 //================Вечерняя тренировка  ( верхний уровень)
			 {
			 {
			 {{{"name","Вечерняя тренировка"} ,{"id","вечерняя_тренировка"}  ,{"parentid",""}}
			 ,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			 },
			 {{{ "showInSpinner","0"  } ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""}}},
			 {{{"tags",""}}},
			 {{{"parameters"}
			 }       },

			 {},{},{},{},{},{}, //резерв
			 {   
			 //{{"5500"},{" (180+"},{"0"},{"1"}},
			 //{{"3"},{"2"},{"0"},{"сказать","уборка дома"}},
			 }
			 }
			 ,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},

			 }
			 },
			 //=====================
			 //================в течение дня ( верхний уровень)
			 {
		     {		 
			 {{{"name","В течение дня"} ,{"id","в_течение_дня"}  ,{"parentid",""}}
			 ,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
			 },
			 {{{  "showInSpinner","0" } ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""}}},
			 {{{"tags",""}}},
			 {{{"parameters"}
			 }       },

			 {},{},{},{},{},{}, //резерв
			 {   
			 //{{"5500"},{" (180+"},{"0"},{"1"}},
			 //{{"3"},{"2"},{"0"},{"сказать","уборка дома"}},
			 }
			 }
			 ,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},

			 }
			 },
			 //=====================
			 */
			//=========== хоккей в арке =====

			{ 
			  {
				{{{"name","хоккей в арке"} ,{"id","хоккей_в_арке"} ,{"parentid",""}   }  
					,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  }    
				},
				{{{"showInSpinner","0"},{"повторить,раз","1"},{"отсрочка старта,сек","5"},{"дата последнего выполнения",""}}},
				{{{"tags","универсальные"}}},
				{{{"parameters"}
						//,{"par999","float","наименование тренировки","универсальный случайный счетчик до 10 видов команд"}
						,{"par000","float","скорость (%)","100","значение рассчитать по формуле",""}
							,{"par001","string","общее количество упражнений","150","значение рассчитать по формуле",""}

	,{"par011","string","команда упр 1","1","значение рассчитать по формуле",""}
	,{"par012","string","длительность упр 1 (сек)","1","значение рассчитать по формуле",""}
							,{"par013","string","пропорция упр 1","2" ,"значение рассчитать по формуле",""}

	,{"par021","string","команда упр 2","2","значение рассчитать по формуле",""}
							,{"par022","string","длительность упр 2 (сек)","1","значение рассчитать по формуле",""}
							,{"par023","string","пропорция упр 2","2","значение рассчитать по формуле",""}

							,{"par031","string","команда упр 3","3","значение рассчитать по формуле",""}
							,{"par032","string","длительность упр 3 (сек)","1","значение рассчитать по формуле",""}
							,{"par033","string","пропорция упр 3","2","значение рассчитать по формуле",""}

							,{"par041","string","команда упр 4","","значение рассчитать по формуле",""}
							,{"par042","string","длительность упр 4 (сек)","1","значение рассчитать по формуле",""}
							,{"par043","string","пропорция упр 4","2","значение рассчитать по формуле",""}

							,{"par051","string","команда упр 5","бросок","значение рассчитать по формуле",""}
							,{"par052","string","длительность упр 5 (сек)","2","значение рассчитать по формуле",""}
							,{"par053","string","пропорция упр 5","1","значение рассчитать по формуле",""}

							,{"par061","string","команда упр 6","6","значение рассчитать по формуле",""}
							,{"par062","string","длительность упр 6 (сек)","3","значение рассчитать по формуле",""}
							,{"par063","string","пропорция упр 6","0","значение рассчитать по формуле",""}

							,{"par071","string","команда упр 7","7","значение рассчитать по формуле",""}
							,{"par072","string","длительность упр 7 (сек)","3","значение рассчитать по формуле",""}
							,{"par073","string","пропорция упр 7","0","значение рассчитать по формуле",""}

							,{"par081","string","команда упр 8","8","значение рассчитать по формуле",""}
							,{"par082","string","длительность упр 8 (сек)","3","значение рассчитать по формуле",""}
							,{"par083","string","пропорция упр 8","0","значение рассчитать по формуле",""}

							,{"par091","string","команда упр 9","9","значение рассчитать по формуле",""}
							,{"par092","string","длительность упр 9 (сек)","3","значение рассчитать по формуле",""}
							,{"par093","string","пропорция упр 9","0","значение рассчитать по формуле",""}

							,{"par101","string","команда упр 10","10","значение рассчитать по формуле",""}
							,{"par102","string","длительность упр 10 (сек)","3","значение рассчитать по формуле",""}
							,{"par103","string","пропорция упр 10","0","значение рассчитать по формуле",""}
					}       },

				{},{},{},{},{},{}, //резерв
				{   
					//{{"1","раз по"},{"10", "сек с дисперсией"},{"0"},{"сказать","первая цифра - положение корпуса. вторая цифра - положение шайбы"}}, 
						{{"par001","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","->универсальная_1_10"}},     

				}
			  }
				,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},
					/*1*/{{{"name","универсальная 1-10"},{"id","универсальная_1_10"}}, {{ "ОБЩАЯ ФРАЗА",""}
							,{ "СКАЗАТЬ:","par011" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par013","ДЛИТЕЛЬНОСТЬ (СЕК):","  par012*(100/par000)" }
							,{ "СКАЗАТЬ:","par021" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par023","ДЛИТЕЛЬНОСТЬ (СЕК):","  par022*(100/par000)" }
							,{ "СКАЗАТЬ:","par031" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par033","ДЛИТЕЛЬНОСТЬ (СЕК):","  par032*(100/par000)" }
							,{ "СКАЗАТЬ:","par041" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par043","ДЛИТЕЛЬНОСТЬ (СЕК):","  par042*(100/par000)" }
							,{ "СКАЗАТЬ:","par051" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par053","ДЛИТЕЛЬНОСТЬ (СЕК):","  par052*(100/par000)" }
							//,{ "СКАЗАТЬ:","par010" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par1000","ДЛИТЕЛЬНОСТЬ (СЕК):","  par012*(100/par1)" }
							,{ "СКАЗАТЬ:","par061" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par063","ДЛИТЕЛЬНОСТЬ (СЕК):","  par062*(100/par000)" }
							,{ "СКАЗАТЬ:","par071" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par073","ДЛИТЕЛЬНОСТЬ (СЕК):","  par072*(100/par000)" }
							,{ "СКАЗАТЬ:","par081" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par083","ДЛИТЕЛЬНОСТЬ (СЕК):","  par082*(100/par000)" }
							,{ "СКАЗАТЬ:","par091" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par093","ДЛИТЕЛЬНОСТЬ (СЕК):","  par092*(100/par000)" }
							,{ "СКАЗАТЬ:","par101" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par103","ДЛИТЕЛЬНОСТЬ (СЕК):","  par102*(100/par000)" }

						}},

				}
			},
			//=====================
			//=========== хоккей или фартлек на дороге =====

			{ {
				{{{"name","хоккей или фартлек на дороге"} ,{"id","фартлек1"}  ,{"parentid",""}}  
					,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
				},
				{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""} }},
				{{{"tags","универсальные"}}},
				{{{"parameters"}
							//,{"par999","float","наименование тренировки","универсальный случайный счетчик до 10 видов команд","значение рассчитать по формуле",""}
							,{"par000","float","скорость (%)","100","значение рассчитать по формуле",""}
							,{"par001","string","общее количество упражнений","250","значение рассчитать по формуле",""}

							,{"par011","string","команда упр 1","направо","значение рассчитать по формуле",""}
							,{"par012","string","длительность упр 1 (сек)","3","значение рассчитать по формуле",""}
							,{"par013","string","пропорция упр 1","2","значение рассчитать по формуле",""}

							,{"par021","string","команда упр 2","налево","значение рассчитать по формуле",""}
							,{"par022","string","длительность упр 2 (сек)","3","значение рассчитать по формуле",""}
							,{"par023","string","пропорция упр 2","2","значение рассчитать по формуле",""}

							,{"par031","string","команда упр 3","медленней","значение рассчитать по формуле",""}
							,{"par032","string","длительность упр 3 (сек)","3","значение рассчитать по формуле",""}
							,{"par033","string","пропорция упр 3","2","значение рассчитать по формуле",""}

							,{"par041","string","команда упр 4","быстрей","значение рассчитать по формуле",""}
							,{"par042","string","длительность упр 4 (сек)","3","значение рассчитать по формуле",""}
							,{"par043","string","пропорция упр 4","2","значение рассчитать по формуле",""}

							,{"par051","string","команда упр 5","стоп","значение рассчитать по формуле",""}
							,{"par052","string","длительность упр 5 (сек)","2","значение рассчитать по формуле",""}
							,{"par053","string","пропорция упр 5","1","значение рассчитать по формуле",""}

							,{"par061","string","команда упр 6","6","значение рассчитать по формуле",""}
							,{"par062","string","длительность упр 6 (сек)","3","значение рассчитать по формуле",""}
							,{"par063","string","пропорция упр 6","0","значение рассчитать по формуле",""}

							,{"par071","string","команда упр 7","7","значение рассчитать по формуле",""}
							,{"par072","string","длительность упр 7 (сек)","3","значение рассчитать по формуле",""}
							,{"par073","string","пропорция упр 7","0","значение рассчитать по формуле",""}

							,{"par081","string","команда упр 8","8","значение рассчитать по формуле",""}
							,{"par082","string","длительность упр 8 (сек)","3","значение рассчитать по формуле",""}
							,{"par083","string","пропорция упр 8","0","значение рассчитать по формуле",""}

							,{"par091","string","команда упр 9","9","значение рассчитать по формуле",""}
							,{"par092","string","длительность упр 9 (сек)","3","значение рассчитать по формуле",""}
							,{"par093","string","пропорция упр 9","0" ,"значение рассчитать по формуле",""}

							,{"par101","string","команда упр 10","10","значение рассчитать по формуле",""}
							,{"par102","string","длительность упр 10 (сек)","3","значение рассчитать по формуле",""}
							,{"par103","string","пропорция упр 10","0","значение рассчитать по формуле",""}
					}       },

				{},{},{},{},{},{}, //резерв
				{   
					//{{"1","раз по"},{"10", "сек с дисперсией"},{"0"},{"сказать","первая цифра - положение корпуса. вторая цифра - положение шайбы"}}, 
						{{"par001","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","->универсальная_1_10"}},     

				}
			  }
				,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},
					/*1*/{{{"name","универсальная 1-10"},{"id","универсальная_1_10"}}, {{ "ОБЩАЯ ФРАЗА",""}
							,{ "СКАЗАТЬ:","par011" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par013","ДЛИТЕЛЬНОСТЬ (СЕК):","  par012*(100/par000)" }
							,{ "СКАЗАТЬ:","par021" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par023","ДЛИТЕЛЬНОСТЬ (СЕК):","  par022*(100/par000)" }
							,{ "СКАЗАТЬ:","par031" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par033","ДЛИТЕЛЬНОСТЬ (СЕК):","  par032*(100/par000)" }
							,{ "СКАЗАТЬ:","par041" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par043","ДЛИТЕЛЬНОСТЬ (СЕК):","  par042*(100/par000)" }
							,{ "СКАЗАТЬ:","par051" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par053","ДЛИТЕЛЬНОСТЬ (СЕК):","  par052*(100/par000)" }
							//,{ "СКАЗАТЬ:","par010" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par1000","ДЛИТЕЛЬНОСТЬ (СЕК):","  par012*(100/par1)" }
							,{ "СКАЗАТЬ:","par061" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par063","ДЛИТЕЛЬНОСТЬ (СЕК):","  par062*(100/par000)" }
							,{ "СКАЗАТЬ:","par071" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par073","ДЛИТЕЛЬНОСТЬ (СЕК):","  par072*(100/par000)" }
							,{ "СКАЗАТЬ:","par081" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par083","ДЛИТЕЛЬНОСТЬ (СЕК):","  par082*(100/par000)" }
							,{ "СКАЗАТЬ:","par091" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par093","ДЛИТЕЛЬНОСТЬ (СЕК):","  par092*(100/par000)" }
							,{ "СКАЗАТЬ:","par101" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par103","ДЛИТЕЛЬНОСТЬ (СЕК):","  par102*(100/par000)" }

						}},

				}
			},

			//=====================
			//=========== универсальная настраиваемая 1 (случайные команды) =====

			{
			  {
				{{{"name","универсальный СЛУЧАЙНЫЙ счетчик до 10 видов команд"} ,{"id","универсальная_случайная_настраиваемая_1"}  ,{"parentid","шаблоны"}}
					,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
				},
				{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"}  ,{"дата последнего выполнения",""} }},
				{{{"tags","универсальные"}}},
				{{{"parameters"}
						//,{"par999","float","наименование тренировки","универсальный случайный счетчик до 10 видов команд"}
							,{"par000","float","скорость (%)","100","значение рассчитать по формуле",""}
							,{"par001","string","общее количество упражнений","50","значение рассчитать по формуле",""}

							,{"par011","string","команда упр 1","1","значение рассчитать по формуле",""}
							,{"par012","string","длительность упр 1 (сек)","3","значение рассчитать по формуле",""}
							,{"par013","string","пропорция упр 1","1","значение рассчитать по формуле",""}

							,{"par021","string","команда упр 2","2","значение рассчитать по формуле",""}
							,{"par022","string","длительность упр 2 (сек)","3","значение рассчитать по формуле",""}
							,{"par023","string","пропорция упр 2","1","значение рассчитать по формуле",""}

							,{"par031","string","команда упр 3","3","значение рассчитать по формуле",""}
							,{"par032","string","длительность упр 3 (сек)","3","значение рассчитать по формуле",""}
							,{"par033","string","пропорция упр 3","1","значение рассчитать по формуле",""}

							,{"par041","string","команда упр 4","4","значение рассчитать по формуле",""}
							,{"par042","string","длительность упр 4 (сек)","3","значение рассчитать по формуле",""}
							,{"par043","string","пропорция упр 4","1","значение рассчитать по формуле",""}

							,{"par051","string","команда упр 5","5","значение рассчитать по формуле",""}
							,{"par052","string","длительность упр 5 (сек)","3","значение рассчитать по формуле",""}
							,{"par053","string","пропорция упр 5","1","значение рассчитать по формуле",""}

							,{"par061","string","команда упр 6","6","значение рассчитать по формуле",""}
							,{"par062","string","длительность упр 6 (сек)","3","значение рассчитать по формуле",""}
							,{"par063","string","пропорция упр 6","1","значение рассчитать по формуле",""}

							,{"par071","string","команда упр 7","7","значение рассчитать по формуле",""}
							,{"par072","string","длительность упр 7 (сек)","3","значение рассчитать по формуле",""}
							,{"par073","string","пропорция упр 7","1","значение рассчитать по формуле",""}

							,{"par081","string","команда упр 8","8","значение рассчитать по формуле",""}
							,{"par082","string","длительность упр 8 (сек)","3","значение рассчитать по формуле",""}
							,{"par083","string","пропорция упр 8","1","значение рассчитать по формуле",""}

							,{"par091","string","команда упр 9","9","значение рассчитать по формуле",""}
							,{"par092","string","длительность упр 9 (сек)","3","значение рассчитать по формуле",""}
							,{"par093","string","пропорция упр 9","1","значение рассчитать по формуле",""}

							,{"par101","string","команда упр 10","10","значение рассчитать по формуле",""}
							,{"par102","string","длительность упр 10 (сек)","3","значение рассчитать по формуле",""}
							,{"par103","string","пропорция упр 10","1","значение рассчитать по формуле",""}
					}       },

				{},{},{},{},{},{}, //резерв
				{   
					//{{"1","раз по"},{"10", "сек с дисперсией"},{"0"},{"сказать","первая цифра - положение корпуса. вторая цифра - положение шайбы"}}, 
						{{"par001","раз по"},{"1","сек с дисперсией"},{"0"},{"сказать","->универсальная_1_10"}},     

				}
			  }	
				,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},
					/*1*/{{{"name","универсальная 1-10"},{"id","универсальная_1_10"}}, {{ "ОБЩАЯ ФРАЗА",""}
							,{ "СКАЗАТЬ:","par011" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par013","ДЛИТЕЛЬНОСТЬ (СЕК):","  par012*(100/par000)" }
							,{ "СКАЗАТЬ:","par021" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par023","ДЛИТЕЛЬНОСТЬ (СЕК):","  par022*(100/par000)" }
							,{ "СКАЗАТЬ:","par031" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par033","ДЛИТЕЛЬНОСТЬ (СЕК):","  par032*(100/par000)" }
							,{ "СКАЗАТЬ:","par041" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par043","ДЛИТЕЛЬНОСТЬ (СЕК):","  par042*(100/par000)" }
							,{ "СКАЗАТЬ:","par051" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par053","ДЛИТЕЛЬНОСТЬ (СЕК):","  par052*(100/par000)" }
							//,{ "СКАЗАТЬ:","par010" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par1000","ДЛИТЕЛЬНОСТЬ (СЕК):","  par012*(100/par1)" }
							,{ "СКАЗАТЬ:","par061" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par063","ДЛИТЕЛЬНОСТЬ (СЕК):","  par062*(100/par000)" }
							,{ "СКАЗАТЬ:","par071" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par073","ДЛИТЕЛЬНОСТЬ (СЕК):","  par072*(100/par000)" }
							,{ "СКАЗАТЬ:","par081" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par083","ДЛИТЕЛЬНОСТЬ (СЕК):","  par082*(100/par000)" }
							,{ "СКАЗАТЬ:","par091" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par093","ДЛИТЕЛЬНОСТЬ (СЕК):","  par092*(100/par000)" }
							,{ "СКАЗАТЬ:","par101" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par103","ДЛИТЕЛЬНОСТЬ (СЕК):","  par102*(100/par000)" }

						}},

				}
			},
			//=========== универсальная настраиваемая 2 (последовательность команд) =====

			{
			  {
				{{{"name","универсальный счетчик до 10 видов команд"} ,{"id","универсальная_настраиваемая_1"}  ,{"parentid","шаблоны"} }
					,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
				},
				{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""}}},
				{{{"tags","универсальные"}}},
				{{{"parameters"}
						//,{"par999","float","наименование тренировки","универсальный случайный счетчик до 10 видов команд"}
							,{"par000","float","скорость (%)","100","значение рассчитать по формуле",""}
							,{"par001","string","общее количество упражнений","50","значение рассчитать по формуле",""}

							,{"par011","string","команда упр 1","1","значение рассчитать по формуле",""}
							,{"par012","string","длительность упр 1 (сек)","3","значение рассчитать по формуле",""}
							,{"par013","string","количество повторений упр 1","1","значение рассчитать по формуле",""}

							,{"par021","string","команда упр 2","2","значение рассчитать по формуле",""}
							,{"par022","string","длительность упр 2 (сек)","3","значение рассчитать по формуле",""}
							,{"par023","string","количество повторений упр 2","1","значение рассчитать по формуле",""}

							,{"par031","string","команда упр 3","3","значение рассчитать по формуле",""}
							,{"par032","string","длительность упр 3 (сек)","3","значение рассчитать по формуле",""}
							,{"par033","string","количество повторений упр 3","1","значение рассчитать по формуле",""}

							,{"par041","string","команда упр 4","4","значение рассчитать по формуле",""}
							,{"par042","string","длительность упр 4 (сек)","3","значение рассчитать по формуле",""}
							,{"par043","string","количество повторений упр 4","1" ,"значение рассчитать по формуле",""}

							,{"par051","string","команда упр 5","5","значение рассчитать по формуле",""}
							,{"par052","string","длительность упр 5 (сек)","3","значение рассчитать по формуле",""}
							,{"par053","string","количество повторений упр 5","1","значение рассчитать по формуле",""}

							,{"par061","string","команда упр 6","6","значение рассчитать по формуле",""}
							,{"par062","string","длительность упр 6 (сек)","3","значение рассчитать по формуле",""}
							,{"par063","string","количество повторений упр 6","1","значение рассчитать по формуле",""}

							,{"par071","string","команда упр 7","7","значение рассчитать по формуле",""}
							,{"par072","string","длительность упр 7 (сек)","3","значение рассчитать по формуле",""}
							,{"par073","string","количество повторений упр 7","1","значение рассчитать по формуле",""}

							,{"par081","string","команда упр 8","8","значение рассчитать по формуле",""}
							,{"par082","string","длительность упр 8 (сек)","3","значение рассчитать по формуле",""}
							,{"par083","string","количество повторений упр 8","1","значение рассчитать по формуле",""}

							,{"par091","string","команда упр 9","9","значение рассчитать по формуле",""}
							,{"par092","string","длительность упр 9 (сек)","3","значение рассчитать по формуле",""}
							,{"par093","string","количество повторений упр 9","1","значение рассчитать по формуле",""}

							,{"par101","string","команда упр 10","10","значение рассчитать по формуле",""}
							,{"par102","string","длительность упр 10 (сек)","3","значение рассчитать по формуле",""}
							,{"par103","string","количество повторений упр 10","1","значение рассчитать по формуле",""}
					}       },

				{},{},{},{},{},{}, //резерв
				{   
					//{{"1","раз по"},{"10", "сек с дисперсией"},{"0"},{"сказать","первая цифра - положение корпуса. вторая цифра - положение шайбы"}}, 
					{{"par013","раз по"},{"par012*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par011"}},
					{{"par023","раз по"},{"par022*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par021"}},     
					{{"par033","раз по"},{"par032*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par031"}},
					{{"par043","раз по"},{"par042*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par041"}},     
					{{"par053","раз по"},{"par052*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par051"}},
					{{"par063","раз по"},{"par062*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par061"}},     
					{{"par073","раз по"},{"par072*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par071"}},
					{{"par083","раз по"},{"par082*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par081"}},     
					{{"par093","раз по"},{"par092*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par091"}},
					{{"par103","раз по"},{"par102*(100/par000)","сек с дисперсией"},{"0"},{"сказать","par101"}},     

				}
			 }	
				,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},

				}
			},

			//=========== счетчик для роллерхок =====
			{  
			  {
				{{{"name","счет 1-4 номер квадрата + 1-4 номер квадрата шайбы "} ,{"id","роллерхоккей_счетчик"}  ,{"parentid",""}}
					,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
				},
				{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"},{"дата последнего выполнения",""} }},
				{{{"tags","хоккей#счетчики"}}},
				{{{"parameters"}
							,{"par11","float","скорость (%)","100","значение рассчитать по формуле",""}
							,{"par02","string","комментарий к тренировке","","значение рассчитать по формуле",""}
							,{"par20","string","длительность пустого движения","1","значение рассчитать по формуле",""}
							,{"par00","string","пропорция пустого движения (ни броска ни перебежки)","4","значение рассчитать по формуле",""}
							,{"par3","string","перебежка (если не нужна - оставить пустое поле)","перебежка","значение рассчитать по формуле",""}
							,{"par4","string","длительность перебежка (сек)","2","значение рассчитать по формуле",""}
							,{"par5","string","пропорция перебежки ","3","значение рассчитать по формуле",""}
							,{"par06","string","бросок (если не нужен - оставить пустое поле)","бросок","значение рассчитать по формуле",""}
							,{"par61","string","длительность броска (сек)","3","значение рассчитать по формуле",""}
							,{"par7","string","пропорция броска ","3","значение рассчитать по формуле",""}
					}       },

				{},{},{},{},{},{}, //резерв
				{   
					//{{"1","раз по"},{"10", "сек с дисперсией"},{"0"},{"сказать","первая цифра - положение корпуса. вторая цифра - положение шайбы"}}, 
						{{"150","раз по"},{"1","сек с дисперсией %"},{"40"},{"сказать","->счетчик_роллерхок,счетчик_роллерхок,счетчик_роллерхок_перебежка"}},     

				}
			  }
				,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},
					/*1*/{{{"name","счетчик роллерхокк корпус шайба"},{"id","счетчик_роллерхок"}}, {{ "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","1","С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1","ДЛИТЕЛЬНОСТЬ (СЕК):","par20*(100/par11)"},{ "СКАЗАТЬ:","2" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1","ДЛИТЕЛЬНОСТЬ (СЕК):","par20*(100/par11)" },{  "СКАЗАТЬ:","3" , "С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","par20*(100/par11)"},{  "СКАЗАТЬ:","4", "С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","par20*(100/par11)"}  }},//,{"5" ,"1"},{ "6" ,"1"} ,{ "7" ,"1"},{"8" ,"1"},{ "9" ,"1"} }},
					/*2*/{{{"name","счетчик роллерхокк  перебежка "},{"id","счетчик_роллерхок_перебежка"}}, {{ "ОБЩАЯ ФРАЗА",""}
							,{  "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par00" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","0.01"}
							,{  "СКАЗАТЬ:","par3" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" , "par5" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","par4*(100/par11)"} 
							,{  "СКАЗАТЬ:","par06" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" , "par7" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","par61*(100/par11)"} 
						}},
				}
			},
			//=====================

			//=========== счетчик для роллерхок 2 =====
			{
			  {
				{{{"name","счет 1-N  "} ,{"id","роллерхоккей_счетчик_1_N"}  ,{"parentid",""}}
					,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
				},
				{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"}  ,{"дата последнего выполнения",""} }},
				{{{"tags","хоккей#счетчики"}}},
				{{{"parameters"}
							,{"par001","float","скорость (%)","100","значение рассчитать по формуле",""}
							,{"par2","string","комментарий к тренировки","","значение рассчитать по формуле",""}
							//,{"par3","string","1","1","значение рассчитать по формуле",""}
							,{"par004","string","длительность интервала(сек)","2","значение рассчитать по формуле",""}
							,{"par005","string","1","1","значение рассчитать по формуле",""}
							,{"par500","string","пропорция 1","1","значение рассчитать по формуле",""}
							,{"par006","string","2","2","значение рассчитать по формуле",""}
							,{"par600","string","пропорция 2","1","значение рассчитать по формуле",""}
							,{"par007","string","3","3","значение рассчитать по формуле",""}
							,{"par700","string","пропорция 3","1","значение рассчитать по формуле",""}
							,{"par008","string","4","4","значение рассчитать по формуле",""}
							,{"par800","string","пропорция 4","1","значение рассчитать по формуле",""}
							,{"par009","string","5","5","значение рассчитать по формуле",""}
							,{"par900","string","пропорция 5","0","значение рассчитать по формуле",""}
						//,{"par010","string","6","6"}
						//	,{"par1000","string","пропорция 6","0"}
						//,{"par5","string","пропорция перебежки (к 10)","3"} 
						//,{"par6","string","бросок (если не нужна - оставить пустое поле)","бросок"}
						//,{"par7","string","пропорция броска (к 10)","2"} 
					}       },

				{},{},{},{},{},{}, //резерв
				{   
					//{{"1","раз по"},{"10", "сек с дисперсией"},{"0"},{"сказать","первая цифра - положение корпуса. вторая цифра - положение шайбы"}}, 
						{{"100","раз по"},{"par1","сек с дисперсией"},{"0"},{"сказать","->счетчик_1_N"}},     

				}
			  }	
				,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},
					
					/*1*/{{{"name","счетчик 1-N"},{"id","счетчик_1_N"}}, {{ "ОБЩАЯ ФРАЗА",""}
							,{ "СКАЗАТЬ:","par005" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par500","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par001)" }
							,{ "СКАЗАТЬ:","par006" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par600","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par001)" }
							,{ "СКАЗАТЬ:","par007" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par700","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par001)" }
							,{ "СКАЗАТЬ:","par008" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par800","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par001)" }
							,{ "СКАЗАТЬ:","par009" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par900","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par001)" }
							//,{ "СКАЗАТЬ:","par010" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par1000","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par1)" }
						}},

				}
			},
			//=====================

			//=========== табата 1 =====
			{
			  {	
				{{{"name","табата со случайными упражнениями (8 раз по 20 сек упр и 10 сек отдых)"} ,{"id","табата_случайные_упры"}  ,{"parentid",""}}
					,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
				},
				{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""}}},
				{{{"tags","зарядка#"}}},
					{{{"parameters"},{"par1","float","интенсивность (%)","150","значение рассчитать по формуле",""}
							,{"par2","string","комментарий к тренировке","","значение рассчитать по формуле",""}
						//,{ "par3","string","перебежка (если не нужна - оставить пустой)","перебежка"}
						//,{"par4","string","длительность перебежка (сек)","3"}
						//,{"par5","string","пропорция перебежки (к 6)","1"}
					} },
				{},{},{},{},{},{}, //резерв
				{    
						{{"20/(3*(100/par1))","раз по"},{"3*(100/par1)","сек с дисперсией"},{"0"},{"сказать","->табата_случ_упр"}},     
					{{"5","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","отдых"}}, 
						{{"20/(3*(100/par1))","раз по"},{"3*(100/par1)","сек с дисперсией"},{"0"},{"сказать","->табата_случ_упр"}},   
					{{"5","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","отдых"}}, 
						{{"20/(3*(100/par1))","раз по"},{"3*(100/par1)","сек с дисперсией"},{"0"},{"сказать","->табата_случ_упр"}},     
					{{"5","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","отдых"}}, 
						{{"20/(3*(100/par1))","раз по"},{"3*(100/par1)","сек с дисперсией"},{"0"},{"сказать","->табата_случ_упр"}},     
					{{"5","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","отдых"}}, 
						{{"20/(3*(100/par1))","раз по"},{"3*(100/par1)","сек с дисперсией"},{"0"},{"сказать","->табата_случ_упр"}},     
					{{"5","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","отдых"}}, 
						{{"20/(3*(100/par1))","раз по"},{"3*(100/par1)","сек с дисперсией"},{"0"},{"сказать","->табата_случ_упр"}},     
					{{"5","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","отдых"}}, 
						{{"20/(3*(100/par1))","раз по"},{"3*(100/par1)","сек с дисперсией"},{"0"},{"сказать","->табата_случ_упр"}},     
					{{"5","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","отдых"}}, 
						{{"20/(3*(100/par1))","раз по"},{"3*(100/par1)","сек с дисперсией"},{"0"},{"сказать","->табата_случ_упр"}},     
					{{"5","раз по"},{"2","сек с дисперсией"},{"0"},{"сказать","отдых"}}, 

				}
			  }	
				,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},
					/*1*/{{{"name","табата со случайными упр"},{"id","табата_случ_упр"}}, {{ "ОБЩАЯ ФРАЗА",""}
							,{  "СКАЗАТЬ:","подпрыгнуть на правой" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
							,{  "СКАЗАТЬ:","подпрыгнуть на левой" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
							,{  "СКАЗАТЬ:","подтянуться" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" , "1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"} 
							,{  "СКАЗАТЬ:","отжаться на пальцах" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
							,{  "СКАЗАТЬ:","левый пистолетик" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
							,{  "СКАЗАТЬ:","правый пистолетик" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
							,{  "СКАЗАТЬ:","книжка" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"""}//"}
							,{  "СКАЗАТЬ:","лодочка" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
							,{  "СКАЗАТЬ:","левая лодочка" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
							,{  "СКАЗАТЬ:","правая лодочка" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
							,{  "СКАЗАТЬ:","встать на руки" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
							,{  "СКАЗАТЬ:","курочка" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
						}},//,{"5" ,"1"},{ "6" ,"1"} ,{ "7" ,"1"},{"8" ,"1"},{ "9" ,"1"} }},


				}
			},
			//=====================

			//===========хоккей =====
			{ 
			  {
				{{{"name","хоккей 20 мин. 1 период в 2 пятерки"} ,{"id","хоккей_1пер_2пят"}  ,{"parentid",""}}
					,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
				},
				{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"},{"дата последнего выполнения",""} }},
				{{{"tags","хоккей#"}}},
					{{{"parameters"},{"par1","string","комментарий к тренировке","","значение рассчитать по формуле",""}
				}       },

				{},{},{},{},{},{}, //резерв
				{   
					{{"1","раз по"},{"5", "сек с дисперсией"},{"0"},{"сказать","хоккей один период в две пятерки"}}, 
						{{"18","раз по"},{"10","сек с дисперсией"},{"0"},{"сказать","->ближний1_средний1_дальний1,ближний1_средний1_дальний1,слева1_пусто2_справа1,пас3_пусто4_бросок3"}},     //катание 3 мин 
					{{"1","раз по"},{"3", "сек с дисперсией"},{"0"},{"сказать","Смена. Броски"}},
					{{"1","раз по"},{"15", "сек с дисперсией"},{"0"},{"сказать",""}},
						{{"20","раз по"},{"9","сек с дисперсией"},{"0"},{"сказать","->ближ2_даль1_сред2,щелчок1_(бросок2_кистевой1)(удоб3_неудоб1)_1,вверх1_центр1_вниз1,влево1_центр1_вправо1"}},    //броски 3 мин

					{{"1","раз по"},{"5", "сек с дисперсией"},{"0"},{"сказать","Смена.Катание"}}, 
						{{"18","раз по"},{"10","сек с дисперсией"},{"0"},{"сказать","->ближний1_средний1_дальний1,ближний1_средний1_дальний1,слева1_пусто6_справа1(скорость),пас3_пусто3_бросок7(бросок)"}},     //катание 3 мин (16 скорость 17 бросок)
					{{"1","раз по"},{"3", "сек с дисперсией"},{"0"},{"сказать","Смена. Броски"}},
					{{"1","раз по"},{"15", "сек с дисперсией"},{"0"},{"сказать",""}},
						{{"20","раз по"},{"9","сек с дисперсией"},{"0"},{"сказать","->ближ2_даль1_сред2,щелчок1_(бросок2_кистевой1)(удоб3_неудоб1)_1,вверх1_центр1_вниз1,ближний1_средний1_дальний1"}},    //броски 3 мин

					{{"1","раз по"},{"5", "сек с дисперсией"},{"0"},{"сказать","Смена.Катание"}}, 
						{{"18","раз по"},{"10","сек с дисперсией"},{"0"},{"сказать","->ближний1_средний1_дальний1,ближний1_средний1_дальний1,слева2_пусто1_справа2(маневр),пас7_пусто3_бросок3(пас)"}},     //катание 3 мин (24 маневр 25 пас)
					{{"1","раз по"},{"3", "сек с дисперсией"},{"0"},{"сказать","Смена. Броски"}},
					{{"1","раз по"},{"15", "сек с дисперсией"},{"0"},{"сказать",""}},
						{{"20","раз по"},{"9","сек с дисперсией"},{"0"},{"сказать","->ближ2_даль1_сред2,щелчок1_(бросок2_кистевой1)(удоб3_неудоб1)_1,вверх1_центр1_вниз1,влево1_центр1_вправо1"}},    //броски 3 мин

					{{"1","раз по"},{"3", "сек с дисперсией"},{"0"},{"сказать","Период завершен."}}, 

				}
			  }	
				,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},
					/*1 4*/{{{"name","ближний1 средний1 дальний1"},{"id","ближний1_средний1_дальний1"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","ближний" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:", "средний" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","дальний" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
					/*2 5*/{{{"name","вверх1 центр1 вниз1"},{"id","вверх1_центр1_вниз1"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","вверх" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","центр" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","вниз" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" } }},
					/*3 6*/{{{"name","влево1 центр1 вправо1"},{"id","влево1_центр1_вправо1"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","влево" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","центр" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },{ "СКАЗАТЬ:","вправо" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
					/*4 7*/{{{"name","слева1 пусто2 справа1"},{"id","слева1_пусто2_справа1"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","объехать слева" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","объехать справа" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" } }},
					/*5 8*/{{{"name","пас3 пусто4 бросок3"},{"id","пас3_пусто4_бросок3"}}, {{  "ОБЩАЯ ФРАЗА", ""},{  "СКАЗАТЬ:","пас" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","4"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
					/*6 14*/{{{"name","щелчок1 (бросок2 кистевой1)(удобн3 неудобн1)3"},{"id","щелчок1_(бросок2_кистевой1)(удоб3_неудоб1)_1"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","щелчок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},  { "СКАЗАТЬ:","->13","С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},}},
					/*7 15*/{{{"name","ближняя2 дальная1 средняя2 дист"},{"id","ближ2_даль1_сред2"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","ближняя дистанция" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" }  ,{ "СКАЗАТЬ:","средняя дистанция" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}  ,{ "СКАЗАТЬ:","дальняя дистанция" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" } ,}},
					
					/*8 16*/{{{"name","слева1 пусто6 справа1 (скорость)"},{"id","слева1_пусто6_справа1(скорость)"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","объехать слева" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{  "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","6" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","объехать справа" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
					/*9 17*/{{{"name","пас3 пусто3 бросок7(бросок)"},{"id","пас3_пусто3_бросок7(бросок)"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","пас" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },{  "СКАЗАТЬ:","","С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },{ "СКАЗАТЬ:","бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","7" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" } }},
					
					/*10 24*/{{{"name","слева2 пусто1 справа2 (маневр)"},{"id","слева2_пусто1_справа2(маневр)"}}, {{   "ОБЩАЯ ФРАЗА",""},{  "СКАЗАТЬ:", "объехать слева" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:", "" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{  "СКАЗАТЬ:", "объехать справа" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
					/*11 25*/{{{"name","пас7 пусто3 бросок3(пас)"},{"id","пас7_пусто3_бросок3(пас)"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:",  "пас" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","7" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{  "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{  "СКАЗАТЬ:", "бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
					

				}
			},
			//=====================


			//===========дых лесенка - вдох = выдоху, доводим от минимального до максимального и обратно =====

			{  
			  {
				{{{"name","дыхательная лесенка "},{"id","дых_лесенка"}  ,{"parentid",""} }
					,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
				},
				{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""} }},
				{{{"tags","дых#"}}},
				
/*
					 Math.round(glOcalendar.rithmLinear(glOcalendar.toNum(glOcalendar.currDate,'date'),{x:20200101,y:12},{x:20211212,y:20}))"
					 ,"+Math.round((glOcalendar.rithmSin(glOcalendar.toNum(glOcalendar.currDate,'date'),20200101,20200128,2,0,4)))"
					 ,"раз(вдох и столько же выдох)","дых. в обед равномерно увелич по шагам","","true","",""],
					 
*/

				{{{"parameters"}//,{"par1","string","комментарий к тренировке",""}
							,{"par2min","float","минимальная длительность вдоха и выдоха,сек","5","значение рассчитать по формуле",""}
							,{"par3max","float","максимальная длительность вдоха и выдоха,сек","10","значение рассчитать по формуле","rithmLinearFromDate2DateByNow(на текущую дату_линейно от даты, 01.09.2020, от значения, 10, до даты,01.09.2023, до значения, 20)"}
							,{"par4T","float","длительность тренировки,сек","240","значение рассчитать по формуле",""}
					}       },

				{},{},{},{},{},{}, //резерв
				// {{"param1","descreat","<min>","<max>"},{"param2","descreat","<min>","<max>"},}
				{   
					//{{"1500"},{"прошлосек+1"},{"0"},{"1"}},
						{{"8*par4T / (par2min + par3max)"},{"1"},{"0"},{"сказать","->вдохвыдох4"}},
						{{"8*par4T / (par2min + par3max)"},{"1"},{"0"},{"сказать","->вдохвыдох41"}},
				}
			  }	
				,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},
					/*1*/{{{"name","сказать вдох или выдох4"},{"id"," вдохвыдох4"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","iif(нечетное(целоеделна4(номеритерации1)),ы,о)" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):"," (par2min + (номеритерации1/8-1) * (par3max-par2min)/((1*par4T/(par3max + par2min))-1) )/8"}}},
					/*2*/{{{"name","сказать вдох или выдох41"},{"id"," вдохвыдох41"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","iif(нечетное(целоеделна4(номеритерации1)),ы,о)" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):"," (par3max + ( 1*par4T / (par2min + par3max) - номеритерации1/8+1) * (par3max-par2min)/((1*par4T/(par3max + par2min))-1) )/8"}}},
					
				}

			},


			//===========дых -1 =====

			{
			  {	
				{{{"name","экспер 110011100 медленнаяая дыхательная (220+ 120*sin(3.14*полноевремя(0)/780))/(2*3*60) "},{"id","экспер_дых_ур1"}   ,{"parentid","шаблоны"}}
					,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
				},
				{{{"showInSpinner","0"},{"повторить,раз","1"},{"отсрочка старта,сек","5"}  ,{"дата последнего выполнения",""} }},
				{{{"tags","дых#"}}},
				{{{"parameters"},
							{"par1","string","комментарий к тренировке","","значение рассчитать по формуле",""}
						// {"par2","string","коммента,

					}       },

				{},{},{},{},{},{}, //резерв
				// {{"param1","descreat","<min>","<max>"},{"param2","descreat","<min>","<max>"},}
				{   
					//{{"1500"},{"прошлосек+1"},{"0"},{"1"}},
						{{"1500"},{"0.5"},{"0"},{"сказать","->вдохвыдох2"}},
				}
			  }	
				,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},
		        	/*1*/{{{"name","сказать о или ы2"},{"id"," вдохвыдох2"}}, {{   "ОБЩАЯ ФРАЗА",""},{"СКАЗАТЬ:", "iif(grdssin(номеритерации1*20*grdssin(номеритерации1/80)),о,ы)" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}}},
					
				}

			},
			//======================
			//===========дых 0 =====

			{
			  {
				{{{"name","медленнаяая дыхательная (100/скорость)(220+ 120*sin(3.14*по-лноевремя(0)/780))/(2*3*60) "},{"id","медл_дых_ур1"}  ,{"parentid","шаблоны"} }
					,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
				},
				{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""} }},
				{{{"tags","дых#"}}},
					{{{"parameters"},{"par1","string","комментарий к тренировке","","значение рассчитать по формуле",""}
							,{"par2","float","скорость (%)","100","значение рассчитать по формуле",""}
					}       },

				{},{},{},{},{},{}, //резерв
				// {{"param1","descreat","<min>","<max>"},{"param2","descreat","<min>","<max>"},}
				{   
					//{{"1500"},{"прошлосек+1"},{"0"},{"1"}},
						{{"1500"},{"(100/par2)*((250+ 120*sin(3.14*полноевремя(0)/1000))/(2*3*60))"},{"0"},{"сказать","->вдохвыдох1"}},
				}
			  }	
				,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},
					/*1*/{{{"name","сказать о или ы1"},{"id","вдохвыдох1"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","iif(остатокделна4(номеритерации1)-1,о,ы)" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}}},
	
				}

			},


			//===========бег 180+- =====
			{ 
			 {
				{{{"name","бег частота 180 плюс минус 10"} ,{"id","тест_бег_ур1"}  ,{"parentid",""}}
					,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
				},
				{{{"showInSpinner","0"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""}}},
				{{{"tags","дых#бег#"}}},
					{{{"parameters"},{"par1","string","комментарий к тренировке","","значение рассчитать по формуле",""}
							,{"par2","float","скорость (%)","100","значение рассчитать по формуле",""}
					}       },

				{},{},{},{},{},{}, //резерв
				{   
					//{{"5500"},{" (180+"},{"0"},{"1"}},
						{{"5500"},{"(100/par2)*((840+ 0*sin(3.14*полноевремя(0)/500))/(2*3*60))"},{"0"},{"сказать","->вдохвыдох1"}},
				}
			 }	
				,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},
					/*1*/{{{"name","сказать о или ы1"},{"id","вдохвыдох1"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","iif(остатокделна4(номеритерации1)-1,о,ы)" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}}},
					
				}
			},
			//=====================

			//===========уборка =====
			{
			  {
				{{{"name","уборка"} ,{"id","уборка"}  ,{"parentid",""}}
					,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
				},
				{{{"showInSpinner","bernulli01(0.5)"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""}}},
				{{{"tags",""}}},
				{{{"parameters"}
					}       },

				{},{},{},{},{},{}, //резерв
				{   
					//{{"5500"},{" (180+"},{"0"},{"1"}},
					{{"3"},{"2"},{"0"},{"сказать","уборка дома"}},
				}
			  }	
				,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},

				}
			},
			//=====================


			//===========дух чтение =====
			{
			  {	
				{{{"name","дух чтение"} ,{"id","духчтение"}  ,{"parentid",""}}
					,{{"формула нагрузки 1","","формула поправки (+)", ""}, {"формула нагрузки 2","","формула поправки (+)", ""}  } 
				},
				{{{"showInSpinner","bernulli01(0.2)"} ,{"повторить,раз","1"},{"отсрочка старта,сек","5"} ,{"дата последнего выполнения",""}}},
				{{{"tags",""}}},
				{{{"parameters"}
					}       },

				{},{},{},{},{},{}, //резерв
				{   
					//{{"5500"},{" (180+"},{"0"},{"1"}},
					{{"3"},{"2"},{"0"},{"сказать","уборка дома"}},
				}
			  }	
				,{{{{"ДЕЛА ТРЕНИРОВКИ"}}},

				}
			},
			//=====================







		};

		/*
		 {°°°,{°°,{°,{•,《name》,《разминка амосова》,}•,{•,《id》,《медл_дых_ур2》,}•,}°,}°°,
		 {°°,{°,{•,《showInSpinner》,《0》,}•,}°,}°°,
		 {°°,{°,{•,《tags》,《дых#для ходьбы#в покое#тест#》,}•,}°,}°°,
		 {°°,}°°,
		 {°°,}°°,
		 {°°,}°°,
		 {°°,}°°,
		 {°°,}°°,
		 {°°,}°°,
		 {°°,}°°,
		 {°°,{°,{•,《1》,}•,{•,《4》,}•,{•,《0》,}•,{•,《сказать》,《разминка амосова》,}•,}°,{°,{•,《1》,}•,{•,《7》,}•,{•,《0》,}•,{•,《сказать》,《》,}•,}°,{°,{•,《20》,}•,{•,《(200+ 50*номеритерации1)/1000》,}•,{•,《0》,}•,{•,《сказать》,《а》,}•,}°,}°°,
		 }°°°,
		 */

		//=====================

		public String[][][][]  aDeals100Init =
		{   //==  для дыхательных  ======
			/*0*/{{{"name","ссылка12"},{"id","ссылкатест"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","->1,2","С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:", "1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}}},
			/*1*/{{{"name","сказать о или ы1"},{"id","вдохвыдох1"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","iif(остатокделна4(номеритерации1)-1,о,ы)" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}}},
			/*2*/{{{"name","сказать о или ы2"},{"id"," вдохвыдох2"}}, {{   "ОБЩАЯ ФРАЗА",""},{"СКАЗАТЬ:", "iif(grdssin(номеритерации1*20*grdssin(номеритерации1/80)),о,ы)" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}}},
			/*3*/{{{"name","сказать о или ы3"},{"id"," вдохвыдох3"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","iif(остатокделна4(номеритерации1),о,ы)" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}}},

			//==  для хоккея  ==========
			/*4*/{{{"name","ближний1 средний1 дальний1"},{"id","ближний1_средний1_дальний1"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","ближний" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:", "средний" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","дальний" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
			/*5*/{{{"name","вверх1 центр1 вниз1"},{"id","вверх1_центр1_вниз1"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","вверх" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","центр" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","вниз" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" } }},
			/*6*/{{{"name","влево1 центр1 вправо1"},{"id","влево1_центр1_вправо1"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","влево" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","центр" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },{ "СКАЗАТЬ:","вправо" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
			/*7*/{{{"name","слева1 пусто2 справа1"},{"id","слева1_пусто2_справа1"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","объехать слева" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","объехать справа" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" } }},
			/*8*/{{{"name","пас3 пусто4 бросок3"},{"id","пас3_пусто4_бросок3"}}, {{  "ОБЩАЯ ФРАЗА", ""},{  "СКАЗАТЬ:","пас" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","4"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
			/*9*/{{{"name","щелчок1 бросок4 кистевой2"},{"id","щелчок1_бросок4_кистевой2"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","щелчок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{"СКАЗАТЬ:","бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","4" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },{ "СКАЗАТЬ:","кистевой" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},}},
			/*10*/{{{"name","с удобной3 с неудобной1"},{"id","судобной3_снеудобной1"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","с неудобной" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
			/*11*/{{{"name","бросок2 кистевой1"},{"id","бросок2_кистевой1"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{"СКАЗАТЬ:","кистевой" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},}},
			/*12*/{{{"name","щелчок"},{"id","щелчок_1"}}, {{  "ОБЩАЯ ФРАЗА", ""},{"СКАЗАТЬ:", "щелчок" ,"1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},}},
			/*13*/{{{"name","(бросок2 кистевой1)(удобн3 неудобн1)"},{"id","(бросок2_кистевой1)(удоб3_неудоб1)"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","->11,10" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },}},
			/*14*/{{{"name","щелчок1 (бросок2 кистевой1)(удобн3 неудобн1)3"},{"id","щелчок1_(бросок2_кистевой1)(удоб3_неудоб1)_1"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","щелчок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},  { "СКАЗАТЬ:","->13","С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},}},
			/*15*/{{{"name","ближняя2 дальная1 средняя2 дист"},{"id","ближ2_даль1_сред2"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","ближняя дистанция" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" }  ,{ "СКАЗАТЬ:","средняя дистанция" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}  ,{ "СКАЗАТЬ:","дальняя дистанция" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" } ,}},
			//с акцентами
			//1
			/*16*/{{{"name","слева1 пусто6 справа1 (скорость)"},{"id","слева1_пусто6_справа1(скорость)"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","объехать слева" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{  "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","6" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","объехать справа" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1"  ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
			/*17*/{{{"name","пас3 пусто3 бросок7(бросок)"},{"id","пас3_пусто3_бросок7(бросок)"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","пас" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },{  "СКАЗАТЬ:","","С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },{ "СКАЗАТЬ:","бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","7" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" } }},
			/*18*/{{{"name","щелчок7 бросок3 кистевой2(щелчок)"},{"id","щелчок7_бросок3_кистевой2(щелчок)"}}, {{  "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","щелчок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","7" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },{  "СКАЗАТЬ:","бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:","кистевой" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },}},
			/*19*/{{{"name","с удобной1 с неудобной2(неудобная"},{"id","судобной1_снеудобной2(неудобная)"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },{"СКАЗАТЬ:", "с неудобной" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" } }},
			/*20*/{{{"name","бросок1 кистевой3(кистевой)"},{"id","бросок1_кистевой3(кистевой)"}}, {{  "ОБЩАЯ ФРАЗА",""},{  "СКАЗАТЬ:","бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },{ "СКАЗАТЬ:", "кистевой" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},}},
			/*21*/{{{"name","РЕЗЕРВ(бросок2 кистевой1)(удобн3 неудобн1)"},{"id","(РЕЗЕРВбросок2_кистевой1)(удоб3_неудоб1)"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","->11,10" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },}},
			/*22*/{{{"name","РЕЗЕРВщелчок1 (бросок2 кистевой1)(удобн3 неудобн1)3"},{"id","РЕЗЕРВщелчок1_(бросок2_кистевой1)(удоб3_неудоб1)_1"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","щелчок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },  { "СКАЗАТЬ:","->13" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" },}},
			/*23*/{{{"name","ближняя1 дальная4 средняя1 дист(дальняя)"},{"id","ближ1_даль4_сред1(дальняя)"}}, {{  "ОБЩАЯ ФРАЗА",""},{"СКАЗАТЬ:",  "ближняя дистанция" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" }  ,{  "СКАЗАТЬ:", "средняя дистанция" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" }  ,{  "СКАЗАТЬ:", "дальняя дистанция" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","4" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","" } ,}},
			//2
			/*24*/{{{"name","слева2 пусто1 справа2 (маневр)"},{"id","слева2_пусто1_справа2(маневр)"}}, {{   "ОБЩАЯ ФРАЗА",""},{  "СКАЗАТЬ:", "объехать слева" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{ "СКАЗАТЬ:", "" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{  "СКАЗАТЬ:", "объехать справа" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
			/*25*/{{{"name","пас7 пусто3 бросок3(пас)"},{"id","пас7_пусто3_бросок3(пас)"}}, {{  "ОБЩАЯ ФРАЗА", ""},{ "СКАЗАТЬ:",  "пас" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","7" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{  "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""},{  "СКАЗАТЬ:", "бросок" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","3" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""} }},
			/*26*/{{{"name","счетчик роллерхокк корпус шайба"},{"id","счетчик_роллерхок"}}, {{ "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","1","С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1","ДЛИТЕЛЬНОСТЬ (СЕК):","par20*(100/par11)"},{ "СКАЗАТЬ:","2" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1","ДЛИТЕЛЬНОСТЬ (СЕК):","par20*(100/par11)" },{  "СКАЗАТЬ:","3" , "С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","par20*(100/par11)"},{  "СКАЗАТЬ:","4", "С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","par20*(100/par11)"}  }},//,{"5" ,"1"},{ "6" ,"1"} ,{ "7" ,"1"},{"8" ,"1"},{ "9" ,"1"} }},
			/*27*/{{{"name","счетчик роллерхокк  перебежка "},{"id","счетчик_роллерхок_перебежка"}}, {{ "ОБЩАЯ ФРАЗА",""}
					,{  "СКАЗАТЬ:","" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par00" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","0.01"}
					,{  "СКАЗАТЬ:","par3" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" , "par5" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","par4*(100/par11)"} 
					,{  "СКАЗАТЬ:","par06" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" , "par7" ,"ДЛИТЕЛЬНОСТЬ (СЕК):","par61*(100/par11)"} 
				}},//,{"5" ,"1"},{ "6" ,"1"} ,{ "7" ,"1"},{"8" ,"1"},{ "9" ,"1"} }},
			/*28*/{{{"name","табата со случайными упр"},{"id","табата_случ_упр"}}, {{ "ОБЩАЯ ФРАЗА",""}
					,{  "СКАЗАТЬ:","подпрыгнуть на правой" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
					,{  "СКАЗАТЬ:","подпрыгнуть на левой" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
					,{  "СКАЗАТЬ:","подтянуться" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" , "1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"} 
					,{  "СКАЗАТЬ:","отжаться на пальцах" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
					,{  "СКАЗАТЬ:","левый пистолетик" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
					,{  "СКАЗАТЬ:","правый пистолетик" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
					,{  "СКАЗАТЬ:","книжка" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"""}//"}
					,{  "СКАЗАТЬ:","лодочка" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
					,{  "СКАЗАТЬ:","левая лодочка" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
					,{  "СКАЗАТЬ:","правая лодочка" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
					,{  "СКАЗАТЬ:","встать на руки" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
					,{  "СКАЗАТЬ:","курочка" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"2" ,"ДЛИТЕЛЬНОСТЬ (СЕК):",""}//"3*(100/par1)"}
				}},//,{"5" ,"1"},{ "6" ,"1"} ,{ "7" ,"1"},{"8" ,"1"},{ "9" ,"1"} }},

			/*29*/{{{"name","счетчик 1-N"},{"id","счетчик_1_N"}}, {{ "ОБЩАЯ ФРАЗА",""}
					,{ "СКАЗАТЬ:","par005" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par500","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par001)" }
					,{ "СКАЗАТЬ:","par006" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par600","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par001)" }
					,{ "СКАЗАТЬ:","par007" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par700","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par001)" }
					,{ "СКАЗАТЬ:","par008" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par800","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par001)" }
					,{ "СКАЗАТЬ:","par009" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par900","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par001)" }
					//,{ "СКАЗАТЬ:","par010" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par1000","ДЛИТЕЛЬНОСТЬ (СЕК):","1*(100/par1)" }
				}},//,{"5" ,"1"},{ "6" ,"1"} ,{ "7" ,"1"},{"8" ,"1"},{ "9" ,"1"} }},

			/*30*/{{{"name","универсальная 1-10"},{"id","универсальная_1_10"}}, {{ "ОБЩАЯ ФРАЗА",""}
					,{ "СКАЗАТЬ:","par011" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par013","ДЛИТЕЛЬНОСТЬ (СЕК):","  par012*(100/par000)" }
					,{ "СКАЗАТЬ:","par021" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par023","ДЛИТЕЛЬНОСТЬ (СЕК):","  par022*(100/par000)" }
					,{ "СКАЗАТЬ:","par031" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par033","ДЛИТЕЛЬНОСТЬ (СЕК):","  par032*(100/par000)" }
					,{ "СКАЗАТЬ:","par041" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par043","ДЛИТЕЛЬНОСТЬ (СЕК):","  par042*(100/par000)" }
					,{ "СКАЗАТЬ:","par051" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par053","ДЛИТЕЛЬНОСТЬ (СЕК):","  par052*(100/par000)" }
					//,{ "СКАЗАТЬ:","par010" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par1000","ДЛИТЕЛЬНОСТЬ (СЕК):","  par012*(100/par1)" }
					,{ "СКАЗАТЬ:","par061" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par063","ДЛИТЕЛЬНОСТЬ (СЕК):","  par062*(100/par000)" }
					,{ "СКАЗАТЬ:","par071" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par073","ДЛИТЕЛЬНОСТЬ (СЕК):","  par072*(100/par000)" }
					,{ "СКАЗАТЬ:","par081" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par083","ДЛИТЕЛЬНОСТЬ (СЕК):","  par082*(100/par000)" }
					,{ "СКАЗАТЬ:","par091" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par093","ДЛИТЕЛЬНОСТЬ (СЕК):","  par092*(100/par000)" }
					,{ "СКАЗАТЬ:","par101" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:" ,"par103","ДЛИТЕЛЬНОСТЬ (СЕК):","  par102*(100/par000)" }

				}},

			/*31*/{{{"name","сказать вдох или выдох4"},{"id"," вдохвыдох4"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","iif(нечетное(целоеделна4(номеритерации1)),ы,о)" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):"," (par2min + (номеритерации1/8-1) * (par3max-par2min)/((1*par4T/(par3max + par2min))-1) )/8"}}},
			/*32*/{{{"name","сказать вдох или выдох41"},{"id"," вдохвыдох41"}}, {{   "ОБЩАЯ ФРАЗА",""},{ "СКАЗАТЬ:","iif(нечетное(целоеделна4(номеритерации1)),ы,о)" ,"С ПРОПОРЦ. ВЕРОЯТНОСТЬЮ:","1" ,"ДЛИТЕЛЬНОСТЬ (СЕК):"," (par3max + ( 1*par4T / (par2min + par3max) - номеритерации1/8+1) * (par3max-par2min)/((1*par4T/(par3max + par2min))-1) )/8"}}},



		};




		//>>>>>>>>>>>>>>>>>>>>>>


	}
