package com.mycompany.myapp;

public class RithmFromFile
/*
*загрузка тренировок из текстового файла максимально понятного формата
*Файл состоит из предложений, разделенных точками.
*Простой пример:
*
* Ритм "ритм 1": начиная с 01.03.2020 13:00:00 
*       каждые 5 секунд 
*       озвучить 10 раз
*       дело "дело 1".
* Ритм "ритм 2": начиная с 01.03.2020 13:50
*       каждые 5 секунд 
*       озвучить 10 раз
*       дело "дело 2".
* Дело "дело 1": либо "ннн" с долей вероятности 1 либо "ллл" с долей вероятности 2
* Дело "дело 2": либо дело 1 с долей вероятности 1 либо "ззз" с долей вероятности 2       
*/
{

}
